[
{
"step_title":"Licença",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"BSD 3-Clause License<br>>br>Copyright (c) 2011-2022, Jan Reidemeister e Horst Schmid<br>Todos os direitos reservados.<br>>br>br>Redistribuição e uso em fontes e formulários binários, com ou sem modificação, são permitidos desde que as seguintes condições sejam cumpridas:<br>1. Redistribuições de código fonte devem manter o aviso de direitos autorais acima, esta lista de condições e a seguinte isenção de responsabilidade.<br>2. Redistribuições em formato binário devem reproduzir o aviso de direitos autorais acima, esta lista de condições e a seguinte isenção de responsabilidade na documentação e/ou outros materiais fornecidos com a distribuição.<br>3. Nem o nome do detentor dos direitos autorais nem os nomes de seus contribuintes podem ser usados para endossar ou promover produtos derivados deste software sem permissão prévia por escrito específica.<br>>br>STE SOFTWARE É FORNECIDO PELOS COPYRIGHT HOLDERS AND CONTRIBUTORS 'AS IS' E QUALQUER GARANTIAS EXPRESSAS OU IMPLÍCITAS, INCLUINDO, MAS NÃO LIMITADAS, AS GARANTIAS IMPLÍCITAS DE COMERCIALIZAÇÃO E ADEQUAÇÃO PARA UM PROPÓSITO PARTICULAR SÃO DESCARREGADAS. EM NENHUMA HIPÓTESE O DETENTOR DOS DIREITOS AUTORAIS OU CONTRIBUINTES SERÁ RESPONSÁVEL POR QUAISQUER DANOS DIRETOS, INDIRETOS, INCIDENTAIS, ESPECIAIS, EXEMPLARES OU CONSEQÜENTES (INCLUINDO, MAS NÃO SE LIMITANDO À AQUISIÇÃO DE BENS OU SERVIÇOS SUBSTITUTOS; PERDA DE USO, DADOS OU LUCROS; OU INTERRUPÇÃO DE NEGÓCIOS) CAUSADOS POR QUALQUER FORMA E SOBRE QUALQUER TEORIA DE RESPONSABILIDADE, SEJA EM CONTRATO, RESPONSABILIDADE ESTRITA, OU ATO ILÍCITO (INCLUINDO NEGLIGÊNCIA OU DE OUTRA FORMA) DECORRENTE DE QUALQUER FORMA DO USO DESTE SOFTWARE, MESMO SE AVISADO DA POSSIBILIDADE DE TAIS DANOS.",
"subitems": [
{
"key": "id1",
"desc":"Aceito",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Configuração",
"items": [
{"type": "textfield",
"desc":"Há duas possibilidades para a localização do script, que deve ser executada após a conexão do dispositivo:<br>a) O script está localizado no diretório raiz do dispositivo de armazenamento externo. Nenhuma ação para dispositivos sem tal script. Para isso, digite o nome de seu script sem caminho, sem '/'.<br>b) O script está em seu DSM. E será iniciado em qualquer dispositivo de armazenamento conectado. Digite o nome completo com o caminho, por exemplo '/volume1/mysyn/auto.sh'.<br> O script deve ser executável para o usuário 'root'. O script terá o ponto de montagem do dispositivo (por exemplo, /volumeUSB1/usbshare/) como o primeiro parâmetro ($1) e a partição do dispositivo (por exemplo, usb1p1) como o segundo ($2). Dicas: O script é iniciado com um ambiente <b>empty</b>, você tem que especificar todos os comandos usados com caminho! O nome do script é sensível a maiúsculas e minúsculas!",
"subitems": [{
"key": "config_SCRIPT"
,"desc":"Roteiro para executar"
,"defaultValue": "@SCRIPT@"
,"emptyText":"Nome do roteiro"
,"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"Um valor de saída de 100 do script irá desmontar e ejetar o dispositivo quando o script estiver terminado, todos os outros valores de saída o deixarão montado.<br/><br/> O tempo de busca é o tempo após o disparo por 'udev' para encontrar o ponto de montagem quando um dispositivo tiver sido anexado. O tempo de espera adicional dá ao DSM alguma margem de manobra para montar corretamente o drive antes de iniciar o script.<br/> Você pode ter que aumentar esses tempos, dependendo do seu hardware.",
"subitems": [
{
"key": "config_TRIES"
,"desc":"Tempo de busca (seg)"
,"defaultValue": "@TRIES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Digite um número positivo"
}
}
}
,{
"key": "config_WAIT"
,"desc":"Tempo de espera (seg)"
,"defaultValue": "@WAIT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Digite um número positivo"
}
}
}
]
}
,{
"type": "textfield",
"desc":"O tamanho dos arquivos de registro é automaticamente limitado. Se a contagem de linhas determinada for atingida, a metade mais velha é removida.",
"subitems": [
{
"key": "config_LOG_MAX_LINES"
,"desc":"Número máximo de linhas"
,"defaultValue": "@LOG_MAX_LINES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Digite um número positivo"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Estão disponíveis vários níveis de detalhes de mensagens do arquivo de registro de depuração: 1 ... 8. Quanto mais alto o valor, mais detalhes.",
"subitems": [
{
"key": "config_LOGLEVEL"
,"desc":"Nível de detalhe de log"
,"defaultValue": "@LOGLEVEL@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-8]$/"
,"errorText":"Digite um número positivo 1 ... 8"
}
}
}
]
}
,{
"type": "textfield"
,"desc":"O pacote gera mensagens DSM desktop, que são mostradas no desktop para um grupo de usuários configurável ou para um usuário. Gaste um @ para agrupar nomes, por exemplo, @usuários para todos os usuários"
,"subitems": [{
"key": "config_NOTIFY_USERS"
,"desc":"Exibição de mensagens para"
,"width": "360"
,"defaultValue": "@NOTIFY_USERS@"
,"validator": { "allowBlank": true }
}]
}

,{
"type": "textfield"
,"desc":"Normalmente há uma mensagem de área de trabalho DSM gerada após o término de seu script. A mensagem contém o código de retorno de seu script e o espaço livre restante no dispositivo de armazenamento. Você pode especificar aqui uma lista de códigos de retorno, que não geram tal mensagem."
,"subitems": [{
"key": "config_NO_DSM_MESSAGE_RETURN_CODES"
,"desc":"Códigos de retorno sem mensagem"
,"width": "360"
,"defaultValue": "@NO_DSM_MESSAGE_RETURN_CODES@"
,"emptyText":"por exemplo 0;97;98;99"
,"validator": {
"allowBlank": true
,"regex": {
"expr": "/^[0-9]{1,3}(?:;[0-9]{1,3})*$/"
,"errorText":"Digite um ou mais números de 1...3 dígitos, separados por ponto-e-vírgula"
}
}
}]
}
,{
"type": "combobox",
"desc":"Uso de 'Copy LED':<br/>0: LED não são usados de forma alguma.<br/>1: LIGADO durante a execução ou ejeção, DESLIGADO depois <br/>2: piscando durante a execução ou ejeção, DESLIGADO depois <br/>3: LIGADO durante a execução ou ejeção, depois DESLIGADO (0/100) ou intermitente (outros códigos)<br/>4: piscando durante a execução ou ejeção, depois DESLIGADO ou intermitente (outros códigos ou falha de ejeção)<br/>5: piscando durante a execução ou ejeção, depois DESLIGADO (0/100) ou LIGADO (outros códigos ou falha de ejeção)",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"Copiar LED",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Uso do LED de status:<br/>0: Não usado em absoluto<br/>1: verde durante a execução, verde piscando durante a ejeção, OFF se terminado com 0 ou 100, laranja piscando para outros resultados ou falha na ejeção<br/>2: verde piscando durante a execução ou ejeção, verde se terminado com 0 ou 100, laranja piscando para outros resultados ou falha na ejeção<br/>3: verde durante a execução e durante a ejeção, OFF quando terminado, laranja piscando se falha na ejeção",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"LED de status",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/>Beper use pelo roteiro: Bip curto no início e no final, bip longo triplo para um erro",
"subitems": [{
"key": "config_BEEP",
"desc":"Bipar no início e no final",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield"
,"desc":"Se o script terminar com o código de saída 100, será tentada a ejeção do dispositivo. Você pode especificar o tempo limite (em segundos) para ejetar o dispositivo"
,"subitems": [{
"key": "config_EJECT_TIMEOUT"
,"desc":"Ejetar Timeout [s]"
,"defaultValue": "@EJECT_TIMEOUT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Digite um número positivo"
}
}
}]
}
,{
"type": "textfield",
"desc":"Opcionalmente, você pode especificar um outro script (com caminho completo!), que é no caso de ejeção solicitada (com código de saída 100 de seu primeiro script) executada após a ejeção. Isto pode ser usado, por exemplo, para desligar seu dispositivo USB. Se a ejeção falhou, o argumento será \"Ejeção falhou\", com sucesso sem argumento!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT",
"desc":"Roteiro após ejeção (em DSM)",
"width": "350",
"defaultValue": "@SCRIPT_AFTER_EJECT@",
"validator": {
"allowBlank": true
}
}]
}
]
}
,{
"step_title":"Configuração de segurança",
"items": [{
"type": "combobox",
"desc":"O roteiro com o nome correspondente é executado com privilégios de raiz em seu DSM! Isso pode ser um risco de segurança, especialmente se estiver localizado no dispositivo externo! Para maior segurança é possível uma restrição aos scripts com valores de hash sha256 (impressões digitais) pré-registados.<br/><b>Atualmente existem @ENTRY_COUNT@ hashes script registerd.</b><br/>0: O recurso de segurança não é utilizado. Todos os scripts com nome correspondente são permitidos. Nenhuma mudança de hashes registrados.<br/>1: @HASH_DELETION@ O 1º script após a instalação/configuração será registrado e poderá ser executado repetidamente.<br/>2: O valor do hash de qualquer script com nome correspondente será registrado e executado! (Adicionar hashes)<br/>3: Somente scripts previamente registrados são permitidos. (Registro congelado)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS"
,"autoSelect": true
,"editable": false
,"desc":"Registro de Hash Script"
,"width": "360"
,"mode": "local"
,"valueField": "myId"
,"displayField": "displayText"
,"defaultValue": "@ADD_NEW_FINGERPRINTS@"
,"store": {
"xtype": "arraystore"
,"fields": ["myId", "displayText"]
,"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
,"validator": {
"regex": {
"expr": "/^[@SECURITY_RANGE@].*/"
,"errorText":"Sem hashes previamente registrados, a seleção '3' não faz sentido"
}
}
}]
}]
}
,{
"step_title":"IMPORTANTE: Ação Manual Necessária!",
"items": [{
"type": "textfield",
"desc":"Os pacotes de terceiros são restritos pela Synology no DSM 7.x! Uma vez que a autorun requer permissão do root para realizar seu trabalho, uma etapa manual adicional é necessária após a instalação.<br/>>abrir uma shell de comando SSH para seu NAS (como usuário administrador) e executar o seguinte comando <b>after</b> a instalação é concluída.<br>Em vez de através de uma janela de comando SSH você pode executar este comando através de um script definido pelo usuário (como usuário 'root'), gerado através do painel de controle, tarefa agendada. E execute-o após a instalação concluída.<br> Você pode copiar o comando agora!",
"subitems": [{
"key": "ignore_value",
"desc":"Comando",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

