[
{
"step_title":"Licence",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"BSD 3-Clause License<br><br>Copyright (c) 2011-2022, Jan Reidemeister a Horst Schmid<br>Všechna práva vyhrazena.<br><br>Distribuce a použití ve zdrojové i binární podobě, s modifikací nebo bez ní, jsou povoleny za předpokladu, že jsou splněny následující podmínky:<br>1. Při redistribuci zdrojových kódů musí být zachována výše uvedená poznámka o autorských právech, tento seznam podmínek a následující prohlášení o vyloučení odpovědnosti.<br>2. Při redistribuci v binární podobě musí být v dokumentaci a/nebo dalších materiálech dodaných s distribucí reprodukována výše uvedená poznámka o autorských právech, tento seznam podmínek a následující prohlášení o vyloučení odpovědnosti.<br>3. Jméno držitele autorských práv ani jména jeho přispěvatelů nesmí být použita k podpoře nebo propagaci produktů odvozených z tohoto softwaru bez předchozího výslovného písemného souhlasu.<br><br>TENTO SOFTWARE JE POSKYTOVÁN DRŽITELI AUTORSKÝCH PRÁV A PŘISPĚVATELI \"TAK JAK JE\" A JAKÉKOLIV VÝSLOVNÉ NEBO PŘEDPOKLÁDANÉ ZÁRUKY, VČETNĚ, ALE NEOMEZENĚ, PŘEDPOKLÁDANÝCH ZÁRUK PRODEJNOSTI A VHODNOSTI PRO KONKRÉTNÍ ÚČEL, JSOU VYLOUČENY. DRŽITEL AUTORSKÝCH PRÁV ANI PŘISPĚVATELÉ V ŽÁDNÉM PŘÍPADĚ NENESOU ODPOVĚDNOST ZA JAKÉKOLI PŘÍMÉ, NEPŘÍMÉ, NÁHODNÉ, ZVLÁŠTNÍ, PŘÍKLADNÉ NEBO NÁSLEDNÉ ŠKODY (MIMO JINÉ VČETNĚ OBSTARÁNÍ NÁHRADNÍHO ZBOŽÍ NEBO SLUŽEB, ZTRÁTY UŽITÍ, DAT NEBO ZISKU NEBO PŘERUŠENÍ PROVOZU), AŤ UŽ BYLY ZPŮSOBENY JAKÝMKOLI ZPŮSOBEM A NA ZÁKLADĚ JAKÉKOLI TEORIE ODPOVĚDNOSTI, AŤ UŽ NA ZÁKLADĚ SMLOUVY, PŘÍSNÉ ODPOVĚDNOSTI NEBO DELIKTU (VČETNĚ NEDBALOSTI NEBO JINAK), KTERÉ VZNIKLY V SOUVISLOSTI S POUŽÍVÁNÍM TOHOTO SOFTWARU, A TO I V PŘÍPADĚ, ŽE BYLI NA MOŽNOST VZNIKU TAKOVÉ ŠKODY UPOZORNĚNI.",
"subitems": [
{
"key": "id1",
"desc":"Přijato",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Konfigurace",
"items": [
{"type": "textfield",
"desc":"Existují dvě možnosti umístění skriptu, který by se měl spustit po připojení zařízení:<br>a) Skript je umístěn v kořenovém adresáři externího paměťového zařízení. U zařízení bez takového skriptu se akce neprovádí. Pro tento případ zadejte název skriptu bez cesty, bez '/'.<br>b) Skript se nachází na vašem DSM. A bude spuštěn při každém připojení úložného zařízení. Zadejte celý název s cestou, například '/volume1/mysyn/auto.sh'.<br>Skript musí být spustitelný pro uživatele 'root'. Skript získá přípojný bod zařízení (např. /volumeUSB1/usbshare/) jako první parametr ($1) a oddíl zařízení (např. usb1p1) jako druhý ($2). Nápověda: Skript je spuštěn s <b>prázdným prostředím</b>, všechny použité příkazy musíte zadat pomocí cesty! V názvu skriptu se rozlišují malá a velká písmena!",
"subitems": [{
"key": "config_SCRIPT"
,"desc":"Skript k provedení"
,"defaultValue": "@SCRIPT@"
,"emptyText":"Název skriptu"
,"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"Hodnota ukončení skriptu 100 způsobí odpojení a vysunutí zařízení po dokončení skriptu, všechny ostatní hodnoty ukončení ponechají zařízení připojené.<br/><br/>Čas hledání je čas po spuštění skriptem 'udev' pro nalezení přípojného bodu, když bylo zařízení připojeno. Dodatečná čekací doba dává DSM určitý prostor pro správné připojení jednotky před spuštěním skriptu.<br/>Možná budete muset tyto časy zvýšit v závislosti na vašem hardwaru.",
"subitems": [
{
"key": "config_TRIES"
,"desc":"Doba vyhledávání (s)"
,"defaultValue": "@TRIES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Zadejte kladné číslo"
}
}
}
,{
"key": "config_WAIT"
,"desc":"Doba čekání (s)"
,"defaultValue": "@WAIT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Zadejte kladné číslo"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Velikost souborů protokolu je automaticky omezena. Pokud je dosaženo daného počtu řádků, starší polovina je odstraněna.",
"subitems": [
{
"key": "config_LOG_MAX_LINES"
,"desc":"Maximální počet řádků"
,"defaultValue": "@LOG_MAX_LINES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Zadejte kladné číslo"
}
}
}
]
}
,{
"type": "textfield",
"desc":"K dispozici je několik úrovní podrobnosti zpráv souboru protokolu ladění: 1 ... 8. Čím vyšší hodnota, tím více podrobností.",
"subitems": [
{
"key": "config_LOGLEVEL"
,"desc":"Úroveň podrobnosti protokolu"
,"defaultValue": "@LOGLEVEL@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-8]$/"
,"errorText":"Zadejte kladné číslo 1 ... 8"
}
}
}
]
}
,{
"type": "textfield"
,"desc":"Balíček generuje zprávy na ploše DSM, které se zobrazují na ploše konfigurovatelné skupině uživatelů nebo uživateli. K názvům skupin připojte znak @, např. @users pro všechny uživatele."
,"subitems": [{
"key": "config_NOTIFY_USERS"
,"desc":"Zobrazení zprávy na"
,"width": "360"
,"defaultValue": "@NOTIFY_USERS@"
,"validator": { "allowBlank": true }
}]
}

,{
"type": "textfield"
,"desc":"Obvykle se po dokončení skriptu vygeneruje zpráva na ploše DSM. Zpráva obsahuje návratový kód skriptu a zbývající volné místo na úložném zařízení. Zde můžete zadat seznam návratových kódů, které takovou zprávu negenerují."
,"subitems": [{
"key": "config_NO_DSM_MESSAGE_RETURN_CODES"
,"desc":"Vrácení kódů bez zprávy"
,"width": "360"
,"defaultValue": "@NO_DSM_MESSAGE_RETURN_CODES@"
,"emptyText":"např. 0;97;98;99"
,"validator": {
"allowBlank": true
,"regex": {
"expr": "/^[0-9]{1,3}(?:;[0-9]{1,3})*$/"
,"errorText":"Zadejte jedno nebo více 1..3místných čísel oddělených středníkem."
}
}
}]
}
,{
"type": "combobox",
"desc":"Použití 'Copy LED':<br/>0: LED se vůbec nepoužívají.<br/>1: Zapnuto při spuštění nebo vysunutí, poté vypnuto<br/>2: bliká při spuštění nebo vysunutí, poté vypnuto<br/>3: Zapnuto při spuštění nebo vysunutí, poté vypnuto (0/100) nebo bliká (jiné kódy)<br/>4: bliká při spuštění nebo vysunutí, poté vypnuto nebo bliká (jiné kódy nebo vysunutí selhalo)<br/>5: bliká při spuštění nebo vysunutí, poté vypnuto (0/100) nebo zapnuto (jiné kódy nebo vysunutí selhalo).",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"Kopírování LED",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Použití stavové LED:<br/>0: Nepoužívá se vůbec<br/>1: Zelená za běhu, zelené blikání při vysunutí, vypnuto, pokud skončí s 0 nebo 100, oranžové blikání při jiných výsledcích nebo neúspěšném vysunutí<br/>2: Zelené blikání při běhu skriptu nebo vysunutí, zelené, pokud skončí s 0 nebo 100, oranžové blikání při jiných výsledcích nebo neúspěšném vysunutí<br/>3: Zelené za běhu skriptu a při vysunutí, vypnuto, pokud skončí, oranžové blikání, pokud vysunutí selhalo.",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"Stavová LED dioda",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/>Používání pípáku skriptem: Krátké pípnutí na začátku a na konci, trojité dlouhé pípnutí při chybě.",
"subitems": [{
"key": "config_BEEP",
"desc":"Pípnutí na začátku a na konci",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield"
,"desc":"Pokud skript skončí s kódem ukončení 100, pokusí se zařízení vysunout. Můžete zadat časový limit (v sekundách) pro vysunutí zařízení."
,"subitems": [{
"key": "config_EJECT_TIMEOUT"
,"desc":"Časový limit pro vysunutí [s]"
,"defaultValue": "@EJECT_TIMEOUT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Zadejte kladné číslo"
}
}
}]
}
,{
"type": "textfield",
"desc":"Volitelně můžete zadat další skript (s úplnou cestou!), který se v případě požadovaného vysunutí (s kódem ukončení 100 z vašeho prvního skriptu) provede po vysunutí. Ten lze použít např. k vypnutí zařízení USB. Pokud se vysunutí nezdařilo, bude argumentem \"Vysunutí se nezdařilo\", při úspěchu žádný argument!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT",
"desc":"Skript po vysunutí (v DSM)",
"width": "350",
"defaultValue": "@SCRIPT_AFTER_EJECT@",
"validator": {
"allowBlank": true
}
}]
}
]
}
,{
"step_title":"Konfigurace zabezpečení",
"items": [{
"type": "combobox",
"desc":"Skript s odpovídajícím názvem je spuštěn s právy roota na vašem DSM! To by mohlo představovat bezpečnostní riziko, zejména pokud je umístěn na externím zařízení! Pro lepší zabezpečení je možné omezení na skripty s předem zaregistrovanými hodnotami hash sha256 (otisky prstů).<br/><b>V současné době jsou zaregistrovány hashe skriptů @ENTRY_COUNT@.</b><br/>0: Bezpečnostní funkce se nepoužívá. Všechny skripty se shodným názvem jsou povoleny. Žádná změna registrovaných hashů.<br/>1: @HASH_DELETION@První skript po instalaci/konfiguraci bude zaregistrován a je povoleno jej pak znovu a znovu spouštět.<br/>2: Hodnota hashe jakéhokoli skriptu se shodným názvem bude zaregistrována a spuštěna! (Přidejte hashe)<br/>3: Povoleny jsou pouze dříve registrované skripty. (Registrace je zmrazena)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS"
,"autoSelect": true
,"editable": false
,"desc":"Registrace skriptu Hash"
,"width": "360"
,"mode": "local"
,"valueField": "myId"
,"displayField": "displayText"
,"defaultValue": "@ADD_NEW_FINGERPRINTS@"
,"store": {
"xtype": "arraystore"
,"fields": ["myId", "displayText"]
,"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
,"validator": {
"regex": {
"expr": "/^[@SECURITY_RANGE@].*/"
,"errorText":"Při absenci dříve registrovaných hashů nemá výběr \"3\" žádný smysl"
}
}
}]
}]
}
,{
"step_title":"DŮLEŽITÉ: Nutná ruční akce!",
"items": [{
"type": "textfield",
"desc":"Balíčky třetích stran jsou v systému DSM 7.x omezeny společností Synology! Vzhledem k tomu, že autorun vyžaduje ke své práci oprávnění uživatele root, je po instalaci nutný další ruční krok.<br/><br/>Otevřete příkazový shell SSH k NAS (jako uživatel admin) a proveďte následující příkaz <b>po dokončení instalace</b>.<br>Místo přes příkazové okno SSH můžete tento příkaz provést prostřednictvím uživatelem definovaného skriptu (jako uživatel 'root'), vytvořeného přes ovládací panel, naplánovanou úlohu. A ten spusťte po dokončení instalace.<br>Příkaz si nyní můžete zkopírovat!",
"subitems": [{
"key": "ignore_value",
"desc":"Příkaz",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

