[
{
"step_title":"Licença",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"BSD 3-Clause License<br>>br>Copyright (c) 2011-2023, Jan Reidemeister e Horst Schmid<br>todos os direitos reservados.<br>>br>br>Redistribuição e utilização em fontes e formas binárias, com ou sem modificação, são permitidas desde que sejam cumpridas as seguintes condições:<br>1. Redistribuições de código fonte devem manter o aviso de direitos de autor acima, esta lista de condições e a seguinte exoneração de responsabilidade.<br>2. Redistribuições em formato binário devem reproduzir o aviso de direitos de autor acima, esta lista de condições e a seguinte exoneração de responsabilidade na documentação e/ou outros materiais fornecidos com a distribuição.<br>3. Nem o nome do titular dos direitos de autor nem os nomes dos seus contribuintes podem ser utilizados para endossar ou promover produtos derivados deste software sem autorização prévia específica por escrito.<br>>br>STE SOFTWARE É FORNECIDO PELOS COPYRIGHT HOLDERS AND CONTRIBUTORS 'AS IS' E QUALQUER GARANTIAS EXPRESSAS OU IMPLÍCITAS, INCLUINDO, MAS NÃO LIMITADAS, AS GARANTIAS IMPLÍCITAS DE COMERCIALIZAÇÃO E ADEQUAÇÃO PARA UM PROPÓSITO PARTICULAR SÃO DESCLAMADAS. EM NENHUM CASO O TITULAR OU CONTRIBUINTES DOS DIREITOS DE AUTOR SERÃO RESPONSÁVEIS POR QUAISQUER DANOS DIRECTOS, INDIRECTOS, INCIDENTAIS, ESPECIAIS, EXEMPLARES, OU CONSEQUENTES (INCLUINDO, MAS NÃO LIMITADOS À AQUISIÇÃO DE BENS OU SERVIÇOS SUBSTITUTOS; PERDA DE UTILIZAÇÃO, DADOS OU LUCROS; OU INTERRUPÇÃO DE NEGÓCIOS) CAUSADOS POR QUALQUER FORMA E SOBRE QUALQUER TEORIA DE RESPONSABILIDADE, QUER EM CONTRATO, RESPONSABILIDADE ESTRITA, OU ACTO ILÍCITO (INCLUINDO NEGLIGÊNCIA OU DE OUTRA FORMA) RESULTANTE DE QUALQUER FORMA DA UTILIZAÇÃO DESTE SOFTWARE, MESMO QUE AVISADO DA POSSIBILIDADE DE TAIS DANOS.",
"subitems": [
{
"key": "id1",
"desc":"Aceite",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Configuração",
"items": [
{"type": "textfield",
"desc":"Existem duas possibilidades para a localização do script, que deve ser executada após a ligação do dispositivo:<br>a) O script está localizado no directório raiz do dispositivo de armazenamento externo. Nenhuma acção para dispositivos sem um tal script. Para tal, introduza o nome do seu script sem caminho, sem '/'.<br>b) O script está no seu DSM. E será iniciado em qualquer dispositivo de armazenamento ligado. Introduza o nome completo com o caminho, por exemplo '/volume1/mysyn/auto.sh'.<br> O script deve ser executável para o utilizador 'root'. O script obterá o ponto de montagem do dispositivo (ex. /volumeUSB1/usbshare/) como o primeiro parâmetro (\\$1) e a partição do dispositivo (ex. usb1p1) como o segundo (\\$2). Dicas: O script é iniciado com um ambiente <b>empty</b>, é necessário especificar todos os comandos utilizados com caminho! O nome do script é sensível a maiúsculas e minúsculas!",
"subitems": [{
"key": "config_SCRIPT"
,"desc":"Roteiro a executar"
,"defaultValue": "@SCRIPT@"
,"emptyText":"Nome do guião"
,"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"Um valor de saída de 100 do script irá desmontar e ejectar o dispositivo quando o script estiver terminado, todos os outros valores de saída irão deixá-lo montado.<br/><br/> O tempo de procura é o tempo após o disparo por 'udev' para encontrar o ponto de montagem quando um dispositivo tiver sido ligado. O tempo de espera adicional dá ao DSM alguma margem de manobra para montar correctamente a unidade antes de iniciar o script.<br/> Poderá ter de aumentar esses tempos, dependendo do seu hardware.",
"subitems": [
{
"key": "config_TRIES"
,"desc":"Tempo de pesquisa (seg)"
,"defaultValue": "@TRIES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Introduza um número positivo"
}
}
}
,{
"key": "config_WAIT"
,"desc":"Tempo de espera (seg)"
,"defaultValue": "@WAIT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Introduza um número positivo"
}
}
}
]
}
,{
"type": "textfield",
"desc":"O tamanho dos ficheiros de registo é automaticamente limitado. Se a contagem de linhas dada for atingida, a metade mais velha é removida.",
"subitems": [
{
"key": "config_LOG_MAX_LINES"
,"desc":"Número máximo de linhas"
,"defaultValue": "@LOG_MAX_LINES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Introduza um número positivo"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Estão disponíveis vários níveis de detalhe de mensagens de registo de depuração: 1 ... 8. Quanto mais alto for o valor, mais detalhes.",
"subitems": [
{
"key": "config_LOGLEVEL"
,"desc":"Nível de detalhe de registo"
,"defaultValue": "@LOGLEVEL@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-8]$/"
,"errorText":"Insira um número positivo 1 ... 8"
}
}
}
]
}
,{
"type": "textfield"
,"desc":"O pacote gera mensagens de ambiente de trabalho DSM, que são mostradas no ambiente de trabalho a um grupo de utilizadores configurável ou a um utilizador. Prefira um @ a nomes de grupos, por exemplo @utilizadores para todos os utilizadores"
,"subitems": [{
"key": "config_NOTIFY_USERS"
,"desc":"Exibição de mensagens para"
,"width": "360"
,"defaultValue": "@NOTIFY_USERS@"
,"validator": { "allowBlank": true }
}]
}

,{
"type": "textfield"
,"desc":"Normalmente há uma mensagem de ambiente de trabalho DSM gerada após o seu script estar terminado. A mensagem contém o código de retorno do seu script e o espaço livre restante no dispositivo de armazenamento. Pode especificar aqui uma lista de códigos de retorno, que não geram tal mensagem."
,"subitems": [{
"key": "config_NO_DSM_MESSAGE_RETURN_CODES"
,"desc":"Códigos de retorno sem mensagem"
,"width": "360"
,"defaultValue": "@NO_DSM_MESSAGE_RETURN_CODES@"
,"emptyText":"e.g. 0;97;98;99"
,"validator": {
"allowBlank": true
,"regex": {
"expr": "/^[0-9]{1,3}(?:;[0-9]{1,3})*$/"
,"errorText":"Insira um ou mais números de 1...3 dígitos, separados por ponto-e-vírgula"
}
}
}]
}
,{
"type": "combobox",
"desc":"Utilização de 'Copy LED':<br/>0: Os LED não são de todo utilizados.<br/>1: aceso durante a corrida ou ejecção, apagado depois<br/>2: intermitente durante a corrida ou ejecção, apagado depois<br/>3: aceso durante a corrida ou ejecção, apagado depois (0/100) ou intermitente (outros códigos)<br/>4: intermitente durante a corrida ou ejecção, apagado depois ou intermitente (outros códigos ou ejecção falhando)<br/>5: intermitente durante a corrida ou ejecção, apagado depois (0/100) ou aceso (outros códigos ou ejecçãoFail)",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"Copiar LED",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Utilização do LED de estado:<br/>0: Não usado de todo<br/>1: Verde enquanto funciona, verde a piscar durante a ejecção, OFF se terminado com 0 ou 100, laranja a piscar para outros resultados ou ejecção falhada<br/>2: Verde a piscar enquanto o guião está a funcionar ou a ejectar, verde se terminado com 0 ou 100, laranja a piscar para outros resultados ou ejecção falhada<br/>3: Verde enquanto o guião está a funcionar e durante a ejecção, OFF quando terminado, laranja a piscar se a ejecção falhou",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"LED de estado",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/>Beper use by the script: Bip curto no início e no fim, bip longo triplo para um erro",
"subitems": [{
"key": "config_BEEP",
"desc":"Bipar no início e no fim",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield"
,"desc":"Se o script terminar com o código de saída 100, será tentado ejectar o dispositivo. Pode especificar o tempo limite (em segundos) para ejectar o dispositivo"
,"subitems": [{
"key": "config_EJECT_TIMEOUT"
,"desc":"Ejectar Timeout [s]"
,"defaultValue": "@EJECT_TIMEOUT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Introduza um número positivo"
}
}
}]
}
,{
"type": "textfield",
"desc":"Pode opcionalmente especificar um outro script (com caminho completo!), que é em caso de ejeção solicitada (com código de saída 100 do seu primeiro script) executada após a ejeção. Isto pode ser utilizado, por exemplo, para desligar o seu dispositivo USB. Se a ejecção falhar, o argumento será \"Ejecção falhada\", sem sucesso nenhum argumento!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT"
,"desc":"Roteiro após ejectar (em DSM)"
,"width": "350"
,"defaultValue": "@SCRIPT_AFTER_EJECT@"
,"emptyText":"Nome do guião (opcional)"
,"validator": {
"allowBlank": true
}
}]
}
]
}
,{
"step_title":"Configuração de Segurança",
"items": [{
"type": "combobox",
"desc":"O guião com o nome correspondente é executado com privilégios de raiz no seu DSM! Isso pode ser um risco de segurança, especialmente se estiver localizado no dispositivo externo! Para melhor segurança é possível uma restrição a scripts com valores de hash (impressões digitais) pré-registrados sha256.<br/><b>Currentemente existem @ENTRY_COUNT@ scripts hashes registerd.</b><br/>0: O recurso de segurança não é utilizado. Todos os scripts com nome correspondente são permitidos. Nenhuma alteração de hashes registados.<br/>1: @HASH_DELETION@O primeiro script após instalação/configuração será registado e é permitido executar repetidamente.<br/>2: O valor de hash de qualquer script com nome correspondente será registado e executado! (Adicionar hashes)<br/>3: Só são permitidos scripts previamente registados. (Registo congelado)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS"
,"autoSelect": true
,"editable": false
,"desc":"Registo de Hash Script"
,"width": "360"
,"mode": "local"
,"valueField": "myId"
,"displayField": "displayText"
,"defaultValue": "@ADD_NEW_FINGERPRINTS@"
,"store": {
"xtype": "arraystore"
,"fields": ["myId", "displayText"]
,"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
,"validator": {
"regex": {
"expr": "/^[@SECURITY_RANGE@].*/"
,"errorText":"Sem hashes previamente registados, a selecção '3' não faz sentido"
}
}
}]
}]
}
,{
"step_title":"IMPORTANTE: Acção Manual Necessária!",
"items": [{
"type": "textfield",
"desc":"Os pacotes de terceiros são restringidos pela Synology no DSM 7.x! Uma vez que a autorun requer permissão de root para executar o seu trabalho, é necessário um passo manual adicional após a instalação.<br/><br/>Abrir uma shell de comandos SSH ao seu NAS (como utilizador administrador) e executar o seguinte comando <b> após</b> a instalação é concluída.<br>Em vez de através de uma janela de comandos SSH pode executar este comando através de um script definido pelo utilizador (como utilizador 'root'), gerado através de painel de controlo, tarefa agendada. E execute-o após a instalação concluída.<br>Pode copiar o comando agora!",
"subitems": [{
"key": "ignore_value",
"desc":"Comando",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

