[
{
"step_title":"Licencja",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"Licencja BSD 3-Clause<br><br>Copyright (c) 2011-2022, Jan Reidemeister i Horst Schmid<br>Wszystkie prawa zastrzeżone.<br><br>Redystrybucja i wykorzystanie w formie źródłowej i binarnej, z lub bez modyfikacji, są dozwolone pod warunkiem spełnienia następujących warunków:<br>1. Redystrybucja kodu źródłowego musi zachować powyższą informację o prawach autorskich, niniejszą listę warunków i następujące zrzeczenie.<br>2. Redystrybucja w formie binarnej musi reprodukować powyższą informację o prawach autorskich, niniejszą listę warunków i następujące zrzeczenie w dokumentacji i/lub innych materiałach dostarczonych z dystrybucją.<br>3. Ani nazwa właściciela praw autorskich, ani nazwy jego współpracowników nie mogą być używane do popierania lub promowania produktów pochodzących z tego oprogramowania bez specjalnego wcześniejszego pisemnego zezwolenia.<br><br>Niniejsze oprogramowanie jest dostarczane przez posiadaczy praw autorskich i współtwórców \"takie, jakie jest\", a wszelkie wyraźne lub dorozumiane gwarancje, w tym między innymi dorozumiane gwarancje przydatności handlowej i przydatności do określonego celu, są wyłączone. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
"subitems": [
{
"key": "id1",
"desc":"Zaakceptowany",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Konfiguracja",
"items": [
{"type": "textfield",
"desc":"Istnieją dwie możliwości lokalizacji skryptu, który powinien zostać wykonany po podłączeniu urządzenia:<br>a) Skrypt znajduje się w katalogu głównym zewnętrznego urządzenia pamięci masowej. Brak działania dla urządzeń bez takiego skryptu. Dla tego wpisz nazwę swojego skryptu bez ścieżki, bez '/'.<br>b) Skrypt znajduje się na DSM. I zostanie uruchomiony przy każdym podłączeniu urządzenia pamięci masowej. Wpisz pełną nazwę ze ścieżką, np. '/volume1/mysyn/auto.sh'.<br>Skrypt musi być wykonywalny dla użytkownika 'root'. Skrypt otrzyma punkt montowania urządzenia (np. /volumeUSB1/usbshare/) jako pierwszy parametr (\$1) i partycję urządzenia (np. usb1p1) jako drugi (\$2). Wskazówki: Skrypt jest uruchamiany z <b>pustym środowiskiem</b>, należy podać wszystkie używane polecenia ze ścieżką! W nazwie skryptu rozróżniana jest wielkość liter!",
"subitems": [{
"key": "config_SCRIPT"
,"desc":"Skrypt do wykonania"
,"defaultValue": "@SCRIPT@"
,"emptyText":"Nazwa skryptu"
,"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"Wartość wyjścia 100 ze skryptu będzie odmontować i wysunąć urządzenie po zakończeniu skryptu, wszystkie inne wartości wyjścia będzie zostawić go zamontowane.<br/><br/>Czas wyszukiwania jest czas po wyzwoleniu przez 'udev' do znalezienia punktu mocowania, gdy urządzenie zostało dołączone. Dodatkowy czas oczekiwania daje DSM trochę swobody, aby prawidłowo zamontować dysk przed rozpoczęciem skryptu.<br/>Możesz mieć do zwiększenia tych czasów w zależności od sprzętu.",
"subitems": [
{
"key": "config_TRIES"
,"desc":"Czas wyszukiwania (sek)"
,"defaultValue": "@TRIES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Wprowadź liczbę dodatnią"
}
}
}
,{
"key": "config_WAIT"
,"desc":"Czas oczekiwania (sek)"
,"defaultValue": "@WAIT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Wprowadź liczbę dodatnią"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Rozmiar plików dziennika jest automatycznie ograniczany. Jeśli podana liczba linii zostanie osiągnięta, starsza połowa jest usuwana.",
"subitems": [
{
"key": "config_LOG_MAX_LINES"
,"desc":"Maks. liczba linii"
,"defaultValue": "@LOG_MAX_LINES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Wprowadź liczbę dodatnią"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Dostępnych jest kilka poziomów szczegółowości komunikatów pliku dziennika debugowania: 1 ... 8. Im wyższa wartość tym więcej szczegółów.",
"subitems": [
{
"key": "config_LOGLEVEL"
,"desc":"Poziom szczegółowości dziennika"
,"defaultValue": "@LOGLEVEL@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-8]$/"
,"errorText":"Wprowadź liczbę dodatnią 1 ... 8"
}
}
}
]
}
,{
"type": "textfield"
,"desc":"Pakiet generuje komunikaty pulpitu DSM, które są wyświetlane na pulpicie dla konfigurowalnej grupy użytkowników lub dla użytkownika. Do nazw grup dodajemy znak @, np. @users dla wszystkich użytkowników"
,"subitems": [{
"key": "config_NOTIFY_USERS"
,"desc":"Wyświetlanie komunikatów do"
,"width": "360"
,"defaultValue": "@NOTIFY_USERS@"
,"validator": { "allowBlank": true }
}]
}

,{
"type": "textfield"
,"desc":"Zazwyczaj po zakończeniu skryptu generowany jest komunikat na pulpicie DSM. Komunikat zawiera kod powrotu skryptu oraz pozostałą ilość wolnego miejsca na urządzeniu pamięci masowej. Można tutaj określić listę kodów powrotnych, które nie generują takiego komunikatu."
,"subitems": [{
"key": "config_NO_DSM_MESSAGE_RETURN_CODES"
,"desc":"Kody powrotne bez komunikatu"
,"width": "360"
,"defaultValue": "@NO_DSM_MESSAGE_RETURN_CODES@"
,"emptyText":"np. 0;97;98;99"
,"validator": {
"allowBlank": true
,"regex": {
"expr": "/^[0-9]{1,3}(?:;[0-9]{1,3})*$/"
,"errorText":"Wpisz jedną lub więcej 1...3-cyfrowych liczb, oddzielonych średnikiem"
}
}
}]
}
,{
"type": "combobox",
"desc":"Zastosowanie 'Copy LED':<br/>0: diody nie są w ogóle używane.<br/>1: włączona podczas biegu lub wysuwania, wyłączona po tym<br/>2: migająca podczas biegu lub wysuwania, wyłączona po tym<br/>3: włączona podczas biegu lub wysuwania, po tym wyłączona (0/100) lub migająca (inne kody)<br/>4: migająca podczas biegu lub wysuwania, po tym wyłączona lub migająca (inne kody lub wysuwanie nieudane)<br/>5: migająca podczas biegu lub wysuwania, po tym wyłączona (0/100) lub włączona (inne kody lub wysuwanie nieudane)",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"Dioda LED kopiowania",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Zastosowanie diody statusu:<br/>0: Nieużywana w ogóle<br/>1: Zielona podczas pracy, zielona migająca podczas wysuwania, WYŁĄCZONA jeśli zakończy się z 0 lub 100, pomarańczowa migająca dla innych wyników lub nieudanego wysuwania<br/>2: Zielona migająca podczas pracy skryptu lub wysuwania, zielona jeśli zakończy się z 0 lub 100, pomarańczowa migająca dla innych wyników lub nieudanego wysuwania<br/>3: Zielona podczas pracy skryptu i podczas wysuwania, WYŁĄCZONA po zakończeniu, pomarańczowa migająca jeśli wysuwanie nie powiodło się",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"Dioda LED stanu",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/>Użycie bipera przez skrypt: Krótki sygnał dźwiękowy na początku i końcu, potrójny długi sygnał dźwiękowy dla błędu",
"subitems": [{
"key": "config_BEEP",
"desc":"Sygnał dźwiękowy na początku i na końcu",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield"
,"desc":"Jeśli skrypt zakończy się kodem wyjścia 100, zostanie podjęta próba wysunięcia urządzenia. Można określić limit czasu (w sekundach) na wysunięcie urządzenia"
,"subitems": [{
"key": "config_EJECT_TIMEOUT"
,"desc":"Eject Timeout [s]"
,"defaultValue": "@EJECT_TIMEOUT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Wprowadź liczbę dodatnią"
}
}
}]
}
,{
"type": "textfield",
"desc":"Możesz opcjonalnie określić kolejny skrypt (z pełną ścieżką!), który w przypadku żądania wyrzucenia (z kodem wyjścia 100 z pierwszego skryptu) zostanie wykonany po wyrzuceniu. Może to być użyte np. do wyłączenia urządzenia USB. Jeśli wyrzucenie nie powiedzie się, argumentem będzie 'Ejection failed', przy sukcesie brak argumentu!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT"
,"desc":"Skrypt po wysunięciu (na DSM)"
,"width": "350"
,"defaultValue": "@SCRIPT_AFTER_EJECT@"
,"emptyText":"Nazwa skryptu (opcjonalnie)"
,"validator": {
"allowBlank": true
}
}]
}
]
}
,{
"step_title":"Konfiguracja bezpieczeństwa",
"items": [{
"type": "combobox",
"desc":"Skrypt o takiej samej nazwie jest uruchamiany z uprawnieniami roota na DSM! To może być zagrożenie dla bezpieczeństwa, zwłaszcza jeśli znajduje się na urządzeniu zewnętrznym! W celu zwiększenia bezpieczeństwa można ograniczyć się do skryptów z zarejestrowanymi wcześniej wartościami skrótu sha256 (odcisk palca).<br/><b>Obecnie istnieje @ENTRY_COUNT@ script hashes registerd.</b><br/>0: Zabezpieczenie nie jest używane. Wszystkie skrypty z pasującą nazwą są dozwolone. Brak zmiany zarejestrowanych haseł.<br/>1: @HASH_DELETION@1. skrypt po instalacji/konfiguracji zostanie zarejestrowany i jest dozwolone do wykonania następnie ponownie i ponownie.<br/>2: Wartość hash każdego skryptu z pasującą nazwą zostanie zarejestrowany i wykonane! (Dodaj hasze)<br/>3: Tylko wcześniej zarejestrowane skrypty są dozwolone. (Rejestracja zamrożone)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS"
,"autoSelect": true
,"editable": false
,"desc":"Rejestracja Script Hash"
,"width": "360"
,"mode": "local"
,"valueField": "myId"
,"displayField": "displayText"
,"defaultValue": "@ADD_NEW_FINGERPRINTS@"
,"store": {
"xtype": "arraystore"
,"fields": ["myId", "displayText"]
,"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
,"validator": {
"regex": {
"expr": "/^[@SECURITY_RANGE@].*/"
,"errorText":"Przy braku wcześniej zarejestrowanych haseł wybór \"3\" jest bez sensu"
}
}
}]
}]
}
,{
"step_title":"WAŻNE: Wymagana czynność ręczna!",
"items": [{
"type": "textfield",
"desc":"Pakiety innych firm są ograniczone przez Synology w DSM 7.x! Ponieważ autorun wymaga uprawnień roota do wykonywania swojej pracy, wymagany jest dodatkowy ręczny krok po instalacji.<br/><br/>Otwórz powłokę poleceń SSH na swoim NAS (jako użytkownik admin) i wykonaj następujące polecenie <b>po</b> zakończeniu instalacji.<br>Zamiast okna poleceń SSH możesz wykonać to polecenie za pomocą skryptu zdefiniowanego przez użytkownika (jako użytkownik 'root'), wygenerowanego za pomocą panelu sterowania, zaplanowanego zadania. I uruchomić go po zakończeniu instalacji.<br>Możesz skopiować polecenie teraz!",
"subitems": [{
"key": "ignore_value",
"desc":"Polecenie",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

