[
{
"step_title":"Ruhsat",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"BSD 3-Clause License<br><br>Copyright (c) 2011-2023, Jan Reidemeister and Horst Schmid<br>Tüm hakları saklıdır.<br><br>Kaynak ve ikili formlarda, değişiklik yapılarak veya yapılmadan yeniden dağıtıma ve kullanıma, aşağıdaki koşulların karşılanması şartıyla izin verilir:<br>1. Kaynak kodun yeniden dağıtımları yukarıdaki telif hakkı bildirimini, bu koşullar listesini ve aşağıdaki feragatnameyi muhafaza etmelidir.<br>2. İkili formdaki yeniden dağıtımlar yukarıdaki telif hakkı bildirimini, bu koşullar listesini ve aşağıdaki feragatnameyi dağıtımla birlikte sağlanan belgelerde ve/veya diğer materyallerde yeniden üretmelidir.<br>3. Ne telif hakkı sahibinin adı ne de katkıda bulunanların adları, önceden yazılı izin alınmadan bu yazılımdan türetilen ürünleri desteklemek veya tanıtmak için kullanılamaz.<br><br>BU YAZILIM, TELİF HAKKI SAHİPLERİ VE KATKIDA BULUNANLAR TARAFINDAN 'OLDUĞU GİBİ' SAĞLANMAKTADIR VE SATILABİLİRLİK VE BELİRLİ BİR AMACA UYGUNLUK ZIMNİ GARANTİLERİ DAHİL ANCAK BUNLARLA SINIRLI OLMAMAK ÜZERE HER TÜRLÜ AÇIK VEYA ZIMNİ GARANTİ REDDEDİLMEKTEDİR. HİÇBİR DURUMDA TELİF HAKKI SAHİBİ VEYA KATKIDA BULUNANLAR, BU YAZILIMIN KULLANIMINDAN KAYNAKLANAN HERHANGİ BİR ŞEKİLDE ORTAYA ÇIKAN DOĞRUDAN, DOLAYLI, ARIZİ, ÖZEL, ÖRNEK VEYA DOLAYLI ZARARLARDAN (İKAME MAL VEYA HİZMETLERİN TEMİNİ; KULLANIM, VERİ VEYA KAR KAYBI VEYA İŞ KESİNTİSİ DAHİL ANCAK BUNLARLA SINIRLI OLMAMAK ÜZERE), BU TÜR BİR ZARAR OLASILIĞI BİLDİRİLMİŞ OLSA DAHİ, SÖZLEŞME, KUSURSUZ SORUMLULUK VEYA HAKSIZ FİİL (İHMAL VEYA BAŞKA BİR ŞEKİLDE) İLE İLGİLİ HERHANGİ BİR SORUMLULUK TEORİSİNDEN SORUMLU TUTULAMAZ.",
"subitems": [
{
"key": "id1",
"desc":"Kabul Edildi",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Konfigürasyon",
"items": [
{"type": "textfield",
"desc":"Cihaz bağlandıktan sonra çalıştırılması gereken komut dosyasının konumu için iki olasılık vardır:<br>a) Komut dosyası harici depolama cihazının kök dizininde bulunur. Böyle bir komut dosyası olmayan cihazlar için işlem yapılmaz. Bunun için komut dosyanızın adını yol olmadan, '/' olmadan girin.<br>b) Komut dosyası DSM'nizdedir. Ve herhangi bir depolama aygıtı bağlandığında başlatılacaktır. Yol ile birlikte tam adını girin, örneğin '/volume1/mysyn/auto.sh'.<br>Betik 'root' kullanıcısı için çalıştırılabilir olmalıdır. Betik, ilk parametre (\\$1) olarak cihazın bağlama noktasını (örn. /volumeUSB1/usbshare/) ve ikinci parametre (\\$2) olarak cihaz bölümünü (örn. usb1p1) alacaktır. İpuçları: Komut dosyası <b>boş bir ortam</b> ile başlatılır, kullanılan tüm komutları yol ile belirtmeniz gerekir! Komut dosyası adı büyük/küçük harfe duyarlıdır!",
"subitems": [{
"key": "config_SCRIPT"
,"desc":"Yürütülecek komut dosyası"
,"defaultValue": "@SCRIPT@"
,"emptyText":"Komut dosyası adı"
,"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"Komut dosyasından 100 çıkış değeri, komut dosyası tamamlandığında aygıtın bağlantısını kesecek ve çıkaracaktır, diğer tüm çıkış değerleri aygıtı takılı bırakacaktır.<br/><br/>Arama süresi, bir aygıt takıldığında bağlama noktasını bulmak için 'udev' tarafından tetiklendikten sonra geçen süredir. Ek bekleme süresi, DSM'ye betiği başlatmadan önce sürücüyü düzgün bir şekilde bağlaması için biraz boşluk verir.<br/>Donanımınıza bağlı olarak bu süreleri artırmanız gerekebilir.",
"subitems": [
{
"key": "config_TRIES"
,"desc":"Arama süresi (sn)"
,"defaultValue": "@TRIES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Pozitif bir sayı girin"
}
}
}
,{
"key": "config_WAIT"
,"desc":"Bekleme süresi (sn)"
,"defaultValue": "@WAIT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Pozitif bir sayı girin"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Günlük dosyalarının boyutu otomatik olarak sınırlandırılır. Verilen satır sayısına ulaşılırsa, eski yarısı kaldırılır.",
"subitems": [
{
"key": "config_LOG_MAX_LINES"
,"desc":"Maks. satır sayısı"
,"defaultValue": "@LOG_MAX_LINES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Pozitif bir sayı girin"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Çeşitli hata ayıklama günlük dosyası mesaj detay seviyeleri mevcuttur: 1 ... 8. Değer ne kadar yüksek olursa o kadar fazla ayrıntı olur.",
"subitems": [
{
"key": "config_LOGLEVEL"
,"desc":"Günlük Ayrıntı Düzeyi"
,"defaultValue": "@LOGLEVEL@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-8]$/"
,"errorText":"Pozitif bir sayı girin 1 ... 8"
}
}
}
]
}
,{
"type": "textfield"
,"desc":"Paket, masaüstünde yapılandırılabilir bir kullanıcı grubuna veya bir kullanıcıya gösterilen DSM masaüstü mesajları oluşturur. Grup adlarının başına bir @ ekleyin, örneğin tüm kullanıcılar için @users"
,"subitems": [{
"key": "config_NOTIFY_USERS"
,"desc":"Mesaj ekranı"
,"width": "360"
,"defaultValue": "@NOTIFY_USERS@"
,"validator": { "allowBlank": true }
}]
}

,{
"type": "textfield"
,"desc":"Normalde, komut dosyanız tamamlandıktan sonra bir DSM masaüstü mesajı oluşturulur. Mesaj, komut dosyanızın dönüş kodunu ve depolama aygıtında kalan boş alanı içerir. Burada böyle bir mesaj oluşturmayan dönüş kodlarının bir listesini belirtebilirsiniz."
,"subitems": [{
"key": "config_NO_DSM_MESSAGE_RETURN_CODES"
,"desc":"Mesajsız dönüş kodları"
,"width": "360"
,"defaultValue": "@NO_DSM_MESSAGE_RETURN_CODES@"
,"emptyText":"örn. 0;97;98;99"
,"validator": {
"allowBlank": true
,"regex": {
"expr": "/^[0-9]{1,3}(?:;[0-9]{1,3})*$/"
,"errorText":"Noktalı virgülle ayrılmış bir veya daha fazla 1..3 basamaklı sayı girin"
}
}
}]
}
,{
"type": "combobox",
"desc":"'Kopyalama LED'i' kullanımı:<br/>0: LED hiç kullanılmaz.<br/>1: Çalışırken veya çıkarırken AÇIK, sonrasında KAPALI<br/>2: Çalışırken veya çıkarırken yanıp söner, sonrasında KAPALI<br/>3: Çalışırken veya çıkarırken AÇIK, sonrasında KAPALI (0/100) veya yanıp söner (diğer kodlar)<br/>4: Çalışırken veya çıkarırken yanıp söner, sonrasında KAPALI veya yanıp söner (diğer kodlar veya çıkarma başarısız)<br/>5: Çalışırken veya çıkarırken yanıp söner, sonrasında KAPALI (0/100) veya AÇIK (diğer kodlar veya çıkarma başarısız)",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"Kopyalama LED'i",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Durum LED'inin kullanımı:<br/>0: Hiç kullanılmaz<br/>1: Çalışırken yeşil, çıkarma sırasında yeşil yanıp sönme, 0 veya 100 ile bittiğinde KAPALI, diğer sonuçlar veya başarısız çıkarma için turuncu yanıp sönme<br/>2: Kod çalışırken veya çıkarılırken yeşil yanıp sönme, 0 veya 100 ile bittiğinde yeşil, diğer sonuçlar veya başarısız çıkarma için turuncu yanıp sönme<br/>3: Kod çalışırken ve çıkarma sırasında yeşil, bittiğinde KAPALI, çıkarma başarısız olduğunda turuncu yanıp sönme",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"Durum LED'i",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/>Script tarafından bip sesi kullanımı: Başlangıç ve bitişte kısa bip sesi, hata için üç kat uzun bip sesi",
"subitems": [{
"key": "config_BEEP",
"desc":"Başlangıçta ve bitişte bip sesi",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield"
,"desc":"Kod 100 çıkış koduyla sona ererse, aygıtın çıkarılması denenecektir. Aygıtın çıkarılması için zaman aşımını (saniye cinsinden) belirtebilirsiniz"
,"subitems": [{
"key": "config_EJECT_TIMEOUT"
,"desc":"Çıkarma Zaman Aşımı [s]"
,"defaultValue": "@EJECT_TIMEOUT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Pozitif bir sayı girin"
}
}
}]
}
,{
"type": "textfield",
"desc":"İsteğe bağlı olarak, talep edilen çıkarma durumunda (1. komut dosyanızdan çıkış kodu 100 ile) çıkarma işleminden sonra çalıştırılan başka bir komut dosyası (tam yolla!) belirtebilirsiniz. Bu, örneğin USB cihazınızı kapatmak için kullanılabilir. Çıkarma başarısız olursa, argüman 'Çıkarma başarısız' olacaktır, başarıda argüman yoktur!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT"
,"desc":"Çıkardıktan sonra komut dosyası (DSM'de)"
,"width": "350"
,"defaultValue": "@SCRIPT_AFTER_EJECT@"
,"emptyText":"Komut dosyası adı (isteğe bağlı)"
,"validator": {
"allowBlank": true
}
}]
}
]
}
,{
"step_title":"Güvenlik Yapılandırması",
"items": [{
"type": "combobox",
"desc":"Eşleşen isme sahip betik DSM'nizde root yetkileriyle çalıştırılır! Bu bir güvenlik riski oluşturabilir, özellikle de harici bir cihazda bulunuyorsa! Daha iyi güvenlik için, önceden kaydedilmiş sha256 hash değerlerine (parmak izleri) sahip betiklerle kısıtlama mümkündür.<br/><b>Şu anda @ENTRY_COUNT@ betik hashleri kayıtlıdır.</b><br/>0: Güvenlik özelliği kullanılmaz. Eşleşen ada sahip tüm komut dosyalarına izin verilir. Kayıtlı hash'lerde değişiklik yok.<br/>1: @HASH_DELETION@Kurulum/konfigürasyondan sonraki ilk script kaydedilecek ve daha sonra tekrar tekrar çalıştırılmasına izin verilecektir.<br/>2: Eşleşen isme sahip herhangi bir script'in hash değeri kaydedilecek ve çalıştırılacaktır! (Hash ekle)<br/>3: Sadece önceden kaydedilmiş betiklere izin verilir. (Kayıt donduruldu)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS"
,"autoSelect": true
,"editable": false
,"desc":"Script Hash kaydı"
,"width": "360"
,"mode": "local"
,"valueField": "myId"
,"displayField": "displayText"
,"defaultValue": "@ADD_NEW_FINGERPRINTS@"
,"store": {
"xtype": "arraystore"
,"fields": ["myId", "displayText"]
,"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
,"validator": {
"regex": {
"expr": "/^[@SECURITY_RANGE@].*/"
,"errorText":"Önceden kaydedilmiş hash'ler olmadığında '3' seçiminin bir anlamı yoktur"
}
}
}]
}]
}
,{
"step_title":"ÖNEMLİ: Manuel İşlem Gerekli!",
"items": [{
"type": "textfield",
"desc":"Üçüncü taraf paketleri DSM 7.x'de Synology tarafından kısıtlanmıştır! Otomatik çalıştırma işini gerçekleştirmek için kök izni gerektirdiğinden, kurulumdan sonra ek bir manuel adım gereklidir.<br/><br/>NAS'ınıza bir SSH komut kabuğu açın (yönetici kullanıcı olarak) ve kurulum tamamlandıktan <b>sonra</b> aşağıdaki komutu çalıştırın.<br>Bu komutu bir SSH komut penceresi yerine, kontrol paneli, zamanlanmış görev aracılığıyla oluşturulan kullanıcı tanımlı bir komut dosyası ('root' kullanıcısı olarak) aracılığıyla çalıştırabilirsiniz. Ve bunu kurulum bittikten sonra çalıştırın.<br>Komutu şimdi kopyalayabilirsiniz!",
"subitems": [{
"key": "ignore_value",
"desc":"Komuta",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

