[
{
"step_title":"Licens",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"BSD 3-Clause License<br><br>Copyright (c) 2011-2022, Jan Reidemeister and Horst Schmid<br>Alla rättigheter förbehållna.<br><br>Distribution och användning av källkod och binär form, med eller utan modifiering, är tillåten under förutsättning att följande villkor är uppfyllda:<br>1. Vid omdistribution av källkod måste ovanstående upphovsrättsmeddelande, denna lista över villkor och följande ansvarsfriskrivning behållas.<br>2. Vid omdistribution i binär form måste ovanstående upphovsrättsmeddelande, denna lista över villkor och följande ansvarsfriskrivning återges i dokumentationen och/eller annat material som tillhandahålls tillsammans med distributionen.<br>3. Varken upphovsrättsinnehavarens namn eller namnen på dess bidragsgivare får användas för att stödja eller marknadsföra produkter som härrör från denna programvara utan särskilt skriftligt förhandstillstånd.<br><br>Denna programvara tillhandahålls av upphovsrättsinnehavarna och bidragsgivarna \"i befintligt skick\" och alla uttryckliga eller underförstådda garantier, inklusive, men inte begränsat till, de underförstådda garantierna om säljbarhet och lämplighet för ett visst ändamål, förkastas. UNDER INGA OMSTÄNDIGHETER SKA UPPHOVSRÄTTSINNEHAVAREN ELLER BIDRAGSGIVARNA VARA ANSVARIGA FÖR DIREKTA, INDIREKTA, TILLFÄLLIGA, SÄRSKILDA, EXEMPLARISKA ELLER FÖLJDSKADOR (INKLUSIVE, MEN INTE BEGRÄNSAT TILL, ANSKAFFNING AV ERSÄTTNINGSVAROR ELLER -TJÄNSTER, FÖRLUST AV ANVÄNDNING, DATA ELLER VINST ELLER AVBROTT I VERKSAMHETEN) OAVSETT ORSAK OCH OAVSETT ANSVARSTEORI, OAVSETT OM DET RÖR SIG OM AVTAL, STRIKT ANSVAR ELLER SKADESTÅND (INKLUSIVE VÅRDSLÖSHET ELLER PÅ ANNAT SÄTT) SOM PÅ NÅGOT SÄTT UPPSTÅR I SAMBAND MED ANVÄNDNINGEN AV DENNA PROGRAMVARA, ÄVEN OM DE HAR UNDERRÄTTATS OM MÖJLIGHETEN TILL SÅDANA SKADOR.",
"subitems": [
{
"key": "id1",
"desc":"Godkänd",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Konfiguration",
"items": [
{"type": "textfield",
"desc":"Det finns två möjligheter när det gäller platsen för skriptet som ska köras efter anslutning av enheten:<br>a) Skriptet finns i rotkatalogen för den externa lagringsenheten. Ingen åtgärd för enheter som inte har ett sådant skript. Ange namnet på skriptet utan sökväg, utan \"/\".<br>b) Skriptet finns på din DSM. Och kommer att startas vid varje anslutning av lagringsenhet. Ange det fullständiga namnet med sökväg, t.ex. \"/volume1/mysyn/auto.sh\".<br>Skriptet måste vara körbart för användaren \"root\". Skriptet hämtar enhetens monteringspunkt (t.ex. /volumeUSB1/usbshare/) som första parameter ($1) och enhetens partition (t.ex. usb1p1) som andra parameter ($2). Tips: Du måste ange alla använda kommandon med path! Skriptnamnet är skiftlägeskänsligt!",
"subitems": [{
"key": "config_SCRIPT"
,"desc":"Skript som ska exekveras"
,"defaultValue": "@SCRIPT@"
,"emptyText":"Skriptnamn"
,"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"Ett utgångsvärde på 100 från skriptet kommer att avmontera och kasta ut enheten när skriptet är färdigt, alla andra utgångsvärden kommer att lämna den monterad.<br/><br/>Söktiden är tiden efter utlösningen av \"udev\" för att hitta monteringspunkten när en enhet har anslutits. Den extra väntetiden ger DSM lite spelrum för att korrekt montera enheten innan skriptet startas.<br/>Du kan behöva öka dessa tider beroende på din maskinvara.",
"subitems": [
{
"key": "config_TRIES"
,"desc":"Söktid (sek)"
,"defaultValue": "@TRIES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Ange ett positivt tal"
}
}
}
,{
"key": "config_WAIT"
,"desc":"Väntetid (sek)"
,"defaultValue": "@WAIT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Ange ett positivt tal"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Storleken på loggfilerna begränsas automatiskt. Om det angivna antalet rader uppnås tas den äldre hälften bort.",
"subitems": [
{
"key": "config_LOG_MAX_LINES"
,"desc":"Max. antal rader"
,"defaultValue": "@LOG_MAX_LINES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Ange ett positivt tal"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Det finns flera detaljeringsnivåer för meddelanden i felsökningsloggfilen: 1 ... 8. Ju högre värde desto mer detaljer.",
"subitems": [
{
"key": "config_LOGLEVEL"
,"desc":"Detaljerad loggnivå"
,"defaultValue": "@LOGLEVEL@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-8]$/"
,"errorText":"Ange ett positivt tal 1 ... 8"
}
}
}
]
}
,{
"type": "textfield"
,"desc":"Paketet genererar DSM-skrivbordsmeddelanden som visas på skrivbordet för en konfigurerbar användargrupp eller en användare. Sätt ett @ före gruppnamn, t.ex. @users för alla användare."
,"subitems": [{
"key": "config_NOTIFY_USERS"
,"desc":"Meddelandedisplay till"
,"width": "360"
,"defaultValue": "@NOTIFY_USERS@"
,"validator": { "allowBlank": true }
}]
}

,{
"type": "textfield"
,"desc":"Normalt genereras ett DSM-skrivbordsmeddelande när skriptet är klart. Meddelandet innehåller skriptets returkod och det återstående lediga utrymmet på lagringsenheten. Du kan här ange en lista över returkoder som inte genererar ett sådant meddelande."
,"subitems": [{
"key": "config_NO_DSM_MESSAGE_RETURN_CODES"
,"desc":"Returkoder utan meddelande"
,"width": "360"
,"defaultValue": "@NO_DSM_MESSAGE_RETURN_CODES@"
,"emptyText":"t.ex. 0;97;97;98;99"
,"validator": {
"allowBlank": true
,"regex": {
"expr": "/^[0-9]{1,3}(?:;[0-9]{1,3})*$/"
,"errorText":"Ange ett eller flera 1...3-siffriga nummer, separerade med semikolon."
}
}
}]
}
,{
"type": "combobox",
"desc":"Användning av \"Copy LED\":<br/>0: LED används inte alls.<br/>1: Tänds under körning eller utmatning, OFF efteråt<br/>2: Blinkar under körning eller utmatning, OFF efteråt<br/>3: Tänds under körning eller utmatning, OFF efteråt (0/100) eller blinkande (andra koder)<br/>4: Blinkar under körning eller utmatning, OFF eller blinkande efteråt (andra koder eller utmatning misslyckad)<br/>5: Blinkar under körning eller utmatning, OFF efteråt (0/100) eller ON (andra koder eller utmatning misslyckad).",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"Kopiera LED",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Användning av status-LED:<br/>0: Används inte alls<br/>1: Grön när skriptet körs, grönt blinkande under utmatning, OFF om det är klart med 0 eller 100, orange blinkande för andra resultat eller misslyckad utmatning<br/>2: Grönt blinkande när skriptet körs eller matas ut, grönt om det är klart med 0 eller 100, orange blinkande för andra resultat eller misslyckad utmatning<br/>3: Grönt när skriptet körs och under utmatning, OFF när det är klart, orange blinkande om utmatningen misslyckades.",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"Status-LED",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/>Beeper som används av skriptet: Kort pip i början och slutet, tredubbelt långt pip vid fel.",
"subitems": [{
"key": "config_BEEP",
"desc":"Pip vid start och slut",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield"
,"desc":"Om skriptet slutar med utgångskoden 100 kommer man att försöka mata ut enheten. Du kan ange timeout (i sekunder) för att kasta ut enheten."
,"subitems": [{
"key": "config_EJECT_TIMEOUT"
,"desc":"Timeout för utmatning [s]"
,"defaultValue": "@EJECT_TIMEOUT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Ange ett positivt tal"
}
}
}]
}
,{
"type": "textfield",
"desc":"Du kan valfritt ange ytterligare ett skript (med fullständig sökväg!), som i händelse av begärd utskjutning (med utgångskod 100 från det första skriptet) utförs efter utskjutningen. Detta kan t.ex. användas för att stänga av din USB-enhet. Om utskjutningen misslyckades kommer argumentet att vara \"Ejection failed\" (utskjutning misslyckad), vid framgång inget argument!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT",
"desc":"Skrift efter utmatning (på DSM)",
"width": "350",
"defaultValue": "@SCRIPT_AFTER_EJECT@",
"validator": {
"allowBlank": true
}
}]
}
]
}
,{
"step_title":"Konfigurering av säkerhet",
"items": [{
"type": "combobox",
"desc":"Skriptet med det matchande namnet utförs med rooträttigheter på din DSM! Det kan vara en säkerhetsrisk, särskilt om det finns på den externa enheten! För bättre säkerhet är det möjligt att begränsa skript med förregistrerade sha256-hashvärden (fingeravtryck).<br/><b>Det finns faktiskt @ENTRY_COUNT@ skript-hashvärden registrerade.</b><br/>0: Säkerhetsfunktionen används inte. Alla skript med matchande namn är tillåtna. Ingen ändring av registrerade hashvärden.<br/>1: @HASH_DELETION@Det första skriptet efter installation/konfiguration kommer att registreras och det är tillåtet att utföra det igen och igen.<br/>2: Hashvärdet av alla skript med matchande namn kommer att registreras och utföras! (Lägg till hashvärden)<br/>3: Endast tidigare registrerade skript är tillåtna. (Registrering fryst)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS"
,"autoSelect": true
,"editable": false
,"desc":"Registrering av skriptash"
,"width": "360"
,"mode": "local"
,"valueField": "myId"
,"displayField": "displayText"
,"defaultValue": "@ADD_NEW_FINGERPRINTS@"
,"store": {
"xtype": "arraystore"
,"fields": ["myId", "displayText"]
,"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
,"validator": {
"regex": {
"expr": "/^[@SECURITY_RANGE@].*/"
,"errorText":"Om det inte finns några tidigare registrerade hash-koder är valet \"3\" meningslöst."
}
}
}]
}]
}
,{
"step_title":"VIKTIGT: Manuell åtgärd krävs!",
"items": [{
"type": "textfield",
"desc":"Tredjepartspaket begränsas av Synology i DSM 7.x! Eftersom autorun kräver root-behörighet för att utföra sitt arbete krävs ytterligare ett manuellt steg efter installationen.<br/><br/>Öppna ett SSH-kommandofönster till din NAS (som administratörsanvändare) och utför följande kommando <b>efter</b> att installationen är klar.<br/>Istället för att använda ett SSH-kommandofönster kan du utföra det här kommandot via ett användardefinierat skript (som användare \"root\"), genererat via kontrollpanelen, schemalagd aktivitet. Och kör det efter avslutad installation.<br>Du kan kopiera kommandot nu!",
"subitems": [{
"key": "ignore_value",
"desc":"Kommando",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

