[
{
"step_title":"Lizenz",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"BSD 3-Klausel-Lizenz<br><br>Copyright (c) 2011-2022, Jan Reidemeister und Horst Schmid<br>Alle Rechte vorbehalten.<br><br>Die Weitergabe und Verwendung in Quell- und Binärform, mit oder ohne Änderungen, ist erlaubt, sofern die folgenden Bedingungen erfüllt sind:<br>1. Bei der Weitergabe des Quellcodes müssen der obige Urheberrechtsvermerk, diese Liste der Bedingungen und der folgende Haftungsausschluss beibehalten werden.<br>2. Bei der Weitergabe in binärer Form müssen der obige Urheberrechtsvermerk, diese Liste der Bedingungen und der folgende Haftungsausschluss in der Dokumentation und/oder anderen Materialien, die mit der Weitergabe bereitgestellt werden, wiedergegeben werden.<br>3. Weder der Name des Copyright-Inhabers noch die Namen der Mitwirkenden dürfen ohne ausdrückliche vorherige schriftliche Genehmigung verwendet werden, um von dieser Software abgeleitete Produkte zu unterstützen oder zu bewerben.<br><br> DIESE SOFTWARE WIRD VON DEN URHEBERN UND MITWIRKERN \"WIE BESEHEN\" ZUR VERFÜGUNG GESTELLT UND JEGLICHE AUSDRÜCKLICHEN ODER STILLSCHWEIGENDEN GARANTIEN, EINSCHLIESSLICH, ABER NICHT BESCHRÄNKT AUF DIE STILLSCHWEIGENDEN GARANTIEN DER HANDELSÜBLICHKEIT UND DER EIGNUNG FÜR EINEN BESTIMMTEN ZWECK, WERDEN AUSGESCHLOSSEN. IN KEINEM FALL HAFTEN DER URHEBERRECHTSINHABER ODER DIE MITWIRKENDEN FÜR DIREKTE, INDIREKTE, ZUFÄLLIGE, BESONDERE, BEISPIELHAFTE SCHÄDEN ODER FOLGESCHÄDEN (EINSCHLIESSLICH, ABER NICHT BESCHRÄNKT AUF DIE BESCHAFFUNG VON ERSATZGÜTERN ODER -DIENSTLEISTUNGEN, NUTZUNGS-, DATEN- ODER GEWINNVERLUSTE ODER GESCHÄFTSUNTERBRECHUNGEN), WIE AUCH IMMER DIESE VERURSACHT WURDEN UND AUF WELCHER HAFTUNGSTHEORIE SIE BERUHEN, OB DURCH VERTRAG, VERSCHULDENSUNABHÄNGIGE HAFTUNG ODER UNERLAUBTE HANDLUNG (EINSCHLIESSLICH FAHRLÄSSIGKEIT ODER ANDERWEITIG), DIE SICH IN IRGENDEINER WEISE AUS DER NUTZUNG DIESER SOFTWARE ERGEBEN, SELBST WENN AUF DIE MÖGLICHKEIT EINES SOLCHEN SCHADENS HINGEWIESEN WURDE.",
"subitems": [
{
"key": "id1",
"desc":"Angenommen",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Konfiguration",
"items": [
{"type": "textfield",
"desc":"Das Skript muss sich im Stammverzeichnis des externen Geräts befinden und als ausführbar für den Benutzer \"root\" festgelegt sein. Es erhält den Einhängepunkt des Geräts (z.B. /volumeUSB1/usbshare/) als ersten Parameter ($1) und die Gerätepartition (z.B. usb1p1) als zweiten ($2). Hinweis: Das Skript wird mit leerer Umgebung ausgeführt, Sie müssen alle verwendeten Befehle mit Pfad angeben!",
"subitems": [{
"key": "config_SCRIPT",
"desc":"Auszuführendes Skript",
"defaultValue": "@SCRIPT@",
"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"Ein Exit-Wert von 100 aus dem Skript wird das Gerät aushängen und auswerfen, wenn das Skript beendet ist, alle anderen Exit-Werte lassen es eingehängt. Die Suchzeit ist die Zeit, die nach dem Auslösen durch udev vergeht, um den Einhängepunkt zu finden, wenn ein Gerät angeschlossen wird. Die zusätzliche Wartezeit gibt dem DSM etwas Spielraum, um das Laufwerk vor dem Start des Skripts ordnungsgemäß einzubinden.<br/>Abhängig von Ihrer Hardware müssen Sie diese Zeiten möglicherweise erhöhen.",
"subitems": [
{
"key": "config_TRIES",
"desc":"Suchzeit (sec)",
"defaultValue": "@TRIES@",
"validator": {
"allowBlank": false,
"fn": "{if (/^([0-9]+)$/.test(arguments[0])) return true; return 'Enter a positive number!'; }"
}
}
,{
"key": "config_WAIT",
"desc":"Wartezeit (sec)",
"defaultValue": "@WAIT@",
"validator": {
"allowBlank": false,
"fn": "{if (/^([0-9]+)$/.test(arguments[0])) return true; return 'Enter a positive number!'; }"
}
}
]
}
,{
"type": "textfield",
"desc":"Die Größe der Protokolldateien wird automatisch begrenzt. Wenn die angegebene Zeilenzahl erreicht ist, wird die ältere Hälfte entfernt.",
"subitems": [
{
"key": "config_LOG_MAX_LINES",
"desc":"Max. Zeilenzahl",
"defaultValue": "@LOG_MAX_LINES@",
"validator": {
"allowBlank": false,
"fn": "{if (/^([0-9]+)$/.test(arguments[0])) return true; return 'Enter a positive number!'; }"
}
}
]
}
,{
"type": "textfield",
"desc":"Das Paket erzeugt DSM-Nachrichten, die auf dem Desktop für konfigurierbare Benutzergruppen oder Benutzer angezeigt werden. Stellen Sie den Gruppennamen ein @ voran, z. B. @users für alle Benutzer",
"subitems": [{
"key": "config_NOTIFY_USERS",
"desc":"Anzeige der Nachricht an",
"width": "360",
"defaultValue": "@NOTIFY_USERS@",
"validator": { "allowBlank": true }
}
]
}
,{
"type": "combobox",
"desc":"Verwendung der 'Kopier-LED':<br/>0: LED wird überhaupt nicht verwendet.<br/>1: EIN während des Laufs oder Auswurfs, danach AUS<br/>2: Blinken während des Laufs oder Auswurfs, danach AUS<br/>3: EIN während des Laufs oder Auswurfs, danach AUS (0/100) oder Blinken (andere Codes)<br/>4: Blinken während des Laufs oder Auswurfs, danach AUS oder Blinken (andere Codes oder Auswurf fehlgeschlagen)<br/>5: Blinken während des Laufs oder Auswurfs, danach AUS (0/100) oder EIN (andere Codes oder AuswurfFehlschlag)",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"LED kopieren",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Verwendung der Status-LED:<br/>0: Gar nicht verwendet<br/>1: Grün während des Skripts, grün blinkend während des Auswerfens, AUS wenn mit 0 oder 100 beendet, orange blinkend für andere Ergebnisse oder fehlgeschlagenes Auswerfen<br/>2: Grün blinkend während des Skripts oder des Auswerfens, grün wenn mit 0 oder 100 beendet, orange blinkend für andere Ergebnisse oder fehlgeschlagenes Auswerfen<br/>3: Grün während des Skripts und während des Auswerfens, AUS wenn beendet, orange blinkend für fehlgeschlagenes Auswerfen",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"Status-LED",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/>Statusanzeige während der Ausführung des Skripts.",
"subitems": [{
"key": "config_BEEP",
"desc":"Signalton bei Start und Ende",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield",
"desc":"Wenn das Skript mit dem Exit-Code 100 endet, wird versucht, das Gerät auszuwerfen. Sie können den Timeout (in Sekunden) für das Auswerfen des Geräts angeben",
"subitems": [{
"key": "config_EJECT_TIMEOUT",
"desc":"Zeitüberschreitung beim Auswerfen [s]",
"defaultValue": "@EJECT_TIMEOUT@",
"validator": {
"allowBlank": false,
"fn": "{if (/^([0-9]+)$/.test(arguments[0])) return true; return 'Enter a positive number!'; }"
}
}]
}
,{
"type": "textfield",
"desc":"Sie können optional ein weiteres Skript (mit vollständigem Pfad!) angeben, das im Falle eines angeforderten Auswurfs (mit Exit-Code 100 aus Ihrem 1. Skript) nach dem Auswurf ausgeführt wird. Dies kann z.B. zum Ausschalten des USB-Gerätes verwendet werden. Wenn der Auswurf fehlgeschlagen ist, lautet das Argument 'Ejection failed', bei Erfolg kein Argument!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT",
"desc":"Skript nach dem Auswerfen (auf DSM)",
"width": "350",
"defaultValue": "@SCRIPT_AFTER_EJECT@",
"validator": {
"allowBlank": true
}
}]
}]
}
,{
"step_title":"Sicherheitskonfiguration",
"items": [{
"type": "combobox",
"desc":"Das Skript mit dem passenden Namen auf Ihrem USB-Gerät wird mit Root-Rechten auf Ihrem DSM ausgeführt! Das kann ein Sicherheitsrisiko darstellen! Zur besseren Sicherheit ist eine Beschränkung auf Skripte mit vorregistrierten sha256 Hashwerten (Fingerabdrücke) möglich.<br/>Aktuell sind @ENTRY_COUNT@ Skript-Hashes registriert.<br/>0: Die Sicherheitsfunktion wird nicht verwendet. Alle Skripte mit passendem Namen sind erlaubt. Keine Änderung der registrierten Hashes.<br/>1: Wahrscheinlich werden alle bisher registrierten Hashes gelöscht. Das 1. Skript nach der Installation/Konfiguration wird registriert und darf dann immer wieder ausgeführt werden.<br/>2: Der Hashwert eines jeden Skripts mit passendem Namen wird registriert und ausgeführt! (Hashes hinzufügen)<br/>3: Nur zuvor registrierte Skripte sind erlaubt. (Registrierung eingefroren)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS",
"autoSelect": true,
"editable": false,
"desc":"Skript Hash-Registrierung",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@ADD_NEW_FINGERPRINTS@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
}]
}]
}
,{
"step_title":"WICHTIG: Manueller Eingriff erforderlich!",
"items": [{
"type": "textfield",
"desc":"Pakete von Drittanbietern werden von Synology in DSM 7.x eingeschränkt! Da Autorun zur Ausführung seiner Aufgabe Root-Rechte benötigt, ist nach der Installation ein zusätzlicher manueller Schritt erforderlich.<br/><br/>SH zu Ihrem NAS (als Admin-Benutzer) und führen Sie den folgenden Befehl aus, nachdem die Installation abgeschlossen ist. Kopieren Sie es jetzt!",
"subitems": [{
"key": "ignore_value",
"desc":"Befehl",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

