[
{
"step_title":"Лицензия",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"BSD 3-Clause License<br><br>Copyright (c) 2011-2022, Jan Reidemeister and Horst Schmid<br>Все права защищены.<br><br>Распространение и использование в исходном и двоичном виде, с изменениями или без, разрешено при соблюдении следующих условий:<br>1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах, данный список условий и следующий отказ от ответственности.<br>2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах, данный список условий и следующий отказ от ответственности в документации и/или других материалах, поставляемых вместе с дистрибутивом.<br>3. Ни имя владельца авторских прав, ни имена его соавторов не могут быть использованы для поддержки или продвижения продуктов, созданных на основе этого программного обеспечения, без специального предварительного письменного разрешения.<br><br>ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ ДЕРЖАТЕЛЯМИ ПРАВА И СОТРУДНИКАМИ \"КАК ЕСТЬ\" И ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ ОТРИЦАЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ ПРАВООБЛАДАТЕЛЬ ИЛИ СОАВТОРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ОБРАЗЦОВЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ЗАПАСНЫХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ ДЕЛОВОЙ АКТИВНОСТИ), КАКИМИ БЫ ПРИЧИНАМИ ОНИ НИ БЫЛИ ВЫЗВАНЫ И ПРИ ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГАЯ ОТВЕТСТВЕННОСТЬ ИЛИ ПРАВОНАРУШЕНИЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКШИЕ КАКИМ-ЛИБО ОБРАЗОМ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ОНИ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.",
"subitems": [
{
"key": "id1",
"desc":"Принято",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Конфигурация",
"items": [
{"type": "textfield",
"desc":"Существует две возможности расположения скрипта, который должен быть выполнен после подключения устройства:<br>a) Скрипт располагается в корневом каталоге внешнего устройства хранения данных. Никаких действий для устройств без такого скрипта. Для этого введите имя вашего скрипта без пути, без '/'.<br>b) Скрипт находится на вашем DSM. И будет запускаться при любом подключении устройства хранения. Введите полное имя с путем, например, '/volume1/mysyn/auto.sh'.<br>Сценарий должен быть исполняемым для пользователя 'root'. Скрипт получит точку монтирования устройства (например, /volumeUSB1/usbshare/) в качестве первого параметра ($1) и раздел устройства (например, usb1p1) в качестве второго ($2). Подсказки: Скрипт запускается с <b>пустым окружением</b>, вы должны указать все используемые команды с помощью path! Имя скрипта чувствительно к регистру!",
"subitems": [{
"key": "config_SCRIPT"
,"desc":"Сценарий для выполнения"
,"defaultValue": "@SCRIPT@"
,"emptyText":"Имя сценария"
,"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"При значении выхода из сценария 100 устройство будет размонтировано и извлечено по завершении сценария, при других значениях выхода оно останется смонтированным.<br/><br/>Время поиска - это время после срабатывания 'udev' для поиска точки монтирования, когда устройство было подключено. Дополнительное время ожидания дает DSM некоторую свободу действий для правильного монтирования диска перед запуском сценария.<br/>Возможно, вам придется увеличить это время в зависимости от вашего оборудования.",
"subitems": [
{
"key": "config_TRIES"
,"desc":"Время поиска (сек)"
,"defaultValue": "@TRIES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Введите положительное число"
}
}
}
,{
"key": "config_WAIT"
,"desc":"Время ожидания (сек)"
,"defaultValue": "@WAIT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Введите положительное число"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Размер файлов журнала автоматически ограничивается. При достижении заданного количества строк старшая половина удаляется.",
"subitems": [
{
"key": "config_LOG_MAX_LINES"
,"desc":"Макс. количество строк"
,"defaultValue": "@LOG_MAX_LINES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Введите положительное число"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Доступно несколько уровней детализации сообщений файла журнала отладки: 1 ... 8. Чем выше значение, тем больше подробностей.",
"subitems": [
{
"key": "config_LOGLEVEL"
,"desc":"Уровень детализации журнала"
,"defaultValue": "@LOGLEVEL@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-8]$/"
,"errorText":"Введите положительное число 1 ... 8"
}
}
}
]
}
,{
"type": "textfield"
,"desc":"Пакет генерирует сообщения рабочего стола DSM, которые отображаются на рабочем столе для настраиваемой группы пользователей или для пользователя. Добавьте символ @ к именам групп, например, @users для всех пользователей."
,"subitems": [{
"key": "config_NOTIFY_USERS"
,"desc":"Отображение сообщения на"
,"width": "360"
,"defaultValue": "@NOTIFY_USERS@"
,"validator": { "allowBlank": true }
}]
}

,{
"type": "textfield"
,"desc":"Обычно после завершения работы сценария генерируется сообщение рабочего стола DSM. Сообщение содержит код возврата вашего сценария и оставшееся свободное место на устройстве хранения. Вы можете указать здесь список кодов возврата, которые не генерируют такое сообщение."
,"subitems": [{
"key": "config_NO_DSM_MESSAGE_RETURN_CODES"
,"desc":"Коды возврата без сообщения"
,"width": "360"
,"defaultValue": "@NO_DSM_MESSAGE_RETURN_CODES@"
,"emptyText":"например, 0;97;98;99"
,"validator": {
"allowBlank": true
,"regex": {
"expr": "/^[0-9]{1,3}(?:;[0-9]{1,3})*$/"
,"errorText":"Введите одно или несколько 1...3-значных чисел, разделенных точкой с запятой"
}
}
}]
}
,{
"type": "combobox",
"desc":"Использование 'Copy LED':<br/>0: светодиод не используется вообще.<br/>1: включение во время работы или извлечения, после этого выключение<br/>2: мигание во время работы или извлечения, после этого выключение<br/>3: включение во время работы или извлечения, после этого выключение (0/100) или мигание (другие коды)<br/>4: мигание во время работы или извлечения, после этого выключение или мигание (другие коды или неудачное извлечение)<br/>5: мигание во время работы или извлечения, после этого выключение (0/100) или включение (другие коды или неудачное извлечение).",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"Светодиод копирования",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Использование светодиодного индикатора состояния:<br/>0: Не используется вообще<br/>1: Зеленый во время работы, зеленый мигает во время выброса, выключен при завершении с 0 или 100, оранжевый мигает при других результатах или неудачном выбросе<br/>2: Зеленый мигает во время работы скрипта или выброса, зеленый при завершении с 0 или 100, оранжевый мигает при других результатах или неудачном выбросе<br/>3: Зеленый во время работы скрипта и во время выброса, выключен при завершении, оранжевый мигает при неудачном выбросе",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"Светодиодный индикатор состояния",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/> Использование скриптом звукового сигнала: Короткий звуковой сигнал в начале и конце, тройной длинный звуковой сигнал при ошибке",
"subitems": [{
"key": "config_BEEP",
"desc":"Звуковой сигнал в начале и конце",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield"
,"desc":"Если сценарий завершается с кодом выхода 100, будет предпринята попытка извлечь устройство. Вы можете указать тайм-аут (в секундах) для извлечения устройства"
,"subitems": [{
"key": "config_EJECT_TIMEOUT"
,"desc":"Тайм-аут извлечения [с]"
,"defaultValue": "@EJECT_TIMEOUT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Введите положительное число"
}
}
}]
}
,{
"type": "textfield",
"desc":"Вы можете указать дополнительный скрипт (с полным путем!), который в случае запрошенного извлечения (с кодом выхода 100 из вашего первого скрипта) выполняется после извлечения. Это может быть использовано, например, для отключения питания USB-устройства. Если выброс не удался, аргументом будет 'Ejection failed', при успехе аргумент отсутствует!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT",
"desc":"Сценарий после извлечения (на DSM)",
"width": "350",
"defaultValue": "@SCRIPT_AFTER_EJECT@",
"validator": {
"allowBlank": true
}
}]
}
]
}
,{
"step_title":"Конфигурация безопасности",
"items": [{
"type": "combobox",
"desc":"Скрипт с соответствующим именем выполняется с правами root на вашем DSM! Это может представлять угрозу безопасности, особенно если он расположен на внешнем устройстве! Для повышения безопасности возможно ограничение на скрипты с предварительно зарегистрированными хэш-значениями sha256 (отпечатки пальцев).<br/><b>В настоящее время зарегистрировано @ENTRY_COUNT@ хэшей скриптов.</b><br/>0: функция безопасности не используется. Разрешены все скрипты с совпадающим именем. Изменение зарегистрированных хэшей запрещено.<br/>1: @HASH_DELETION@Первый скрипт после установки/конфигурации будет зарегистрирован и разрешено выполнять его снова и снова.<br/>2: Хэш-значение любого скрипта с совпадающим именем будет зарегистрировано и выполнено! (Добавить хэши)<br/>3: Разрешено выполнение только ранее зарегистрированных скриптов. (Регистрация заморожена)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS"
,"autoSelect": true
,"editable": false
,"desc":"Регистрация хэша сценария"
,"width": "360"
,"mode": "local"
,"valueField": "myId"
,"displayField": "displayText"
,"defaultValue": "@ADD_NEW_FINGERPRINTS@"
,"store": {
"xtype": "arraystore"
,"fields": ["myId", "displayText"]
,"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
,"validator": {
"regex": {
"expr": "/^[@SECURITY_RANGE@].*/"
,"errorText":"При отсутствии ранее зарегистрированных хэшей выбор '3' не имеет смысла"
}
}
}]
}]
}
,{
"step_title":"ВАЖНО: Требуется ручное действие!",
"items": [{
"type": "textfield",
"desc":"Пакеты сторонних производителей ограничены компанией Synology в DSM 7.x! Поскольку автозапуск требует прав root для выполнения своей работы, после установки необходимо выполнить дополнительный шаг вручную.<br/><br/>Откройте командную оболочку SSH на NAS (от имени пользователя admin) и выполните следующую команду <b>после</b> завершения установки.<br> Вместо командного окна SSH вы можете выполнить эту команду через пользовательский скрипт (от имени пользователя 'root'), созданный через панель управления, запланированное задание. И запустить его после завершения установки.<br>Вы можете скопировать команду сейчас!",
"subitems": [{
"key": "ignore_value",
"desc":"Команда",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

