[
{
"step_title":"Vergunning",
"invalid_next_disabled": true,
"items": [{
"type": "multiselect",
"desc":"BSD 3-Clause License<br><br>Copyright (c) 2011-2022, Jan Reidemeister en Horst Schmid<br>Alle rechten voorbehouden.<br><br>Herdistributie en gebruik in bron- en binaire vorm, met of zonder wijzigingen, zijn toegestaan mits aan de volgende voorwaarden wordt voldaan:<br>1. Herdistributie van de broncode moet de bovenstaande copyrightmelding, deze lijst met voorwaarden en de volgende disclaimer behouden.<br>2. Herdistributie in binaire vorm moet de bovenstaande copyrightmelding, deze lijst met voorwaarden en de volgende disclaimer weergeven in de documentatie en/of andere materialen die bij de distributie worden geleverd.<br>3. Noch de naam van de auteursrechthebbende, noch de namen van zijn medewerkers mogen worden gebruikt om producten afgeleid van deze software te onderschrijven of te promoten zonder specifieke voorafgaande schriftelijke toestemming.<br><br>Deze SOFTWARE WORDT DOOR DE COPYRIGHTHOUDERS EN DE BIJDRAGERS IN DE HUIDIGE STAAT AANGEBODEN EN ALLE UITDRUKKELIJKE OF IMPLICIETEN GARANTIES, MET INBEGRIP VAN MAAR NIET BEPERKT TOT DE IMPLICIETEN GARANTIES VAN VERKOOPBAARHEID EN GESCHIKTHEID VOOR EEN BEPAALD DOEL ZIJN VERWIJDERD. IN GEEN GEVAL ZAL DE HOUDER VAN HET AUTEURSRECHT OF DE MEDEWERKERS AANSPRAKELIJK ZIJN VOOR ENIGE DIRECTE, INDIRECTE, INCIDENTELE, SPECIALE, EXEMPLARISCHE OF GEVOLGSCHADE (INCLUSIEF, MAAR NIET BEPERKT TOT, DE AANSCHAF VAN VERVANGENDE GOEDEREN OF DIENSTEN; VERLIES VAN GEBRUIK, GEGEVENS OF WINST; OF BEDRIJFSONDERBREKING) HOE DAN OOK VEROORZAAKT EN OP GROND VAN ENIGE THEORIE VAN AANSPRAKELIJKHEID, HETZIJ IN CONTRACT, STRIKTE AANSPRAKELIJKHEID OF ONRECHTMATIGE DAAD (INCLUSIEF NALATIGHEID OF ANDERSZINS) DIE OP ENIGERLEI WIJZE VOORTVLOEIT UIT HET GEBRUIK VAN DEZE SOFTWARE, ZELFS INDIEN GEADVISEERD OVER DE MOGELIJKHEID VAN DERGELIJKE SCHADE.",
"subitems": [
{
"key": "id1",
"desc":"Aanvaard",
"defaultValue": false,
"validator": {
"fn": "{return arguments[0];}"
}
}
]
}
]
}
, {
"step_title":"Configuratie",
"items": [
{"type": "textfield",
"desc":"Er zijn twee mogelijkheden voor de locatie van het script, dat moet worden uitgevoerd nadat het apparaat is aangesloten:<br>a) Het script bevindt zich in de hoofdmap van het externe opslagapparaat. Geen actie voor apparaten zonder zo'n script. Voer hiervoor de naam van uw script in zonder pad, zonder '/'.<br>b) Het script staat op uw DSM. En zal worden gestart bij elke verbinding met het opslagapparaat. Voer de volledige naam met pad in, bijvoorbeeld '/volume1/mysyn/auto.sh'.<br>Het script moet uitvoerbaar zijn voor de gebruiker 'root'. Het script krijgt het koppelpunt van het apparaat (bijv. /volumeUSB1/usbshare/) als eerste parameter ($1) en de apparaatpartitie (bijv. usb1p1) als tweede ($2). Hints: Het script wordt gestart met een <b>lege omgeving</b>, je moet alle gebruikte commando's opgeven met pad! De scriptnaam is hoofdlettergevoelig!",
"subitems": [{
"key": "config_SCRIPT"
,"desc":"Uit te voeren script"
,"defaultValue": "@SCRIPT@"
,"emptyText":"Naam van het script"
,"validator": { "allowBlank": false }
}]
}
,{
"type": "textfield",
"desc":"Een exit-waarde van 100 van het script zal het apparaat ontkoppelen en uitwerpen als het script klaar is, alle andere exit-waarden laten het gekoppeld.<br/><br/>De zoektijd is de tijd na de trigger door 'udev' voor het vinden van het koppelpunt als een apparaat is gekoppeld. De extra wachttijd geeft de DSM wat ruimte om de schijf goed te mounten voordat het script wordt gestart.<br/>Het kan zijn dat u deze tijden moet verlengen, afhankelijk van uw hardware.",
"subitems": [
{
"key": "config_TRIES"
,"desc":"Zoektijd (sec)"
,"defaultValue": "@TRIES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Voer een positief getal in"
}
}
}
,{
"key": "config_WAIT"
,"desc":"Wachttijd (sec)"
,"defaultValue": "@WAIT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Voer een positief getal in"
}
}
}
]
}
,{
"type": "textfield",
"desc":"De grootte van de logbestanden wordt automatisch beperkt. Als het opgegeven aantal regels is bereikt, wordt de oudere helft verwijderd.",
"subitems": [
{
"key": "config_LOG_MAX_LINES"
,"desc":"Max. aantal regels"
,"defaultValue": "@LOG_MAX_LINES@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Voer een positief getal in"
}
}
}
]
}
,{
"type": "textfield",
"desc":"Er zijn verschillende detailniveaus voor debug-logbestanden beschikbaar: 1 ... 8. Hoe hoger de waarde, hoe meer details.",
"subitems": [
{
"key": "config_LOGLEVEL"
,"desc":"Log Detailniveau"
,"defaultValue": "@LOGLEVEL@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-8]$/"
,"errorText":"Voer een positief getal in 1 ... 8"
}
}
}
]
}
,{
"type": "textfield"
,"desc":"Het pakket genereert DSM-desktopberichten, die op het bureaublad worden getoond aan een configureerbare gebruikersgroep of aan een gebruiker. Voeg een @ toe aan groepsnamen, bijv. @users voor alle gebruikers."
,"subitems": [{
"key": "config_NOTIFY_USERS"
,"desc":"Berichtweergave naar"
,"width": "360"
,"defaultValue": "@NOTIFY_USERS@"
,"validator": { "allowBlank": true }
}]
}

,{
"type": "textfield"
,"desc":"Normaal gesproken wordt er een DSM-desktopbericht gegenereerd nadat je script is voltooid. Het bericht bevat de retourcode van je script en de resterende vrije ruimte op het opslagapparaat. Je kunt hier een lijst van retourcodes opgeven, die een dergelijk bericht niet genereren."
,"subitems": [{
"key": "config_NO_DSM_MESSAGE_RETURN_CODES"
,"desc":"Retourcodes zonder bericht"
,"width": "360"
,"defaultValue": "@NO_DSM_MESSAGE_RETURN_CODES@"
,"emptyText":"bijv. 0;97;98;99"
,"validator": {
"allowBlank": true
,"regex": {
"expr": "/^[0-9]{1,3}(?:;[0-9]{1,3})*$/"
,"errorText":"Voer een of meer 1..3 cijfers in, gescheiden door een puntkomma."
}
}
}]
}
,{
"type": "combobox",
"desc":"Gebruik van \"Kopieer-LED\":<br/>0: LED wordt helemaal niet gebruikt.<br/>1: AAN tijdens lopen of uitwerpen, daarna UIT<br/>2: knipperen tijdens lopen of uitwerpen, daarna UIT<br/>3: AAN tijdens lopen of uitwerpen, daarna UIT (0/100) of knipperen (andere codes)<br/>4: knipperen tijdens lopen of uitwerpen, daarna UIT of knipperen (andere codes of uitwerpfalen)<br/>5: knipperen tijdens lopen of uitwerpen, daarna UIT (0/100) of AAN (andere codes of uitwerpfalen)",
"subitems": [{
"key": "config_LED_COPY",
"autoSelect": true,
"editable": false,
"desc":"Kopieer LED",
"defaultValue": "@LED_COPY@",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 ON - ON - OFF"], [2, "2 flash - flash - OFF"], [3, "3 ON - ON - OFF or flash"], [4, "4 flash - flash - OFF or flash"], [5, "5 flash - flash - OFF or ON"]]
}
}]
}
,{
"type": "combobox",
"desc":"Gebruik van de status-LED:<br/>0: Wordt helemaal niet gebruikt<br/>1: Groen terwijl het script loopt, groen knipperend tijdens het uitwerpen, UIT als het klaar is met 0 of 100, oranje knipperend voor andere resultaten of mislukte uitwerping<br/>2: Groen knipperend terwijl het script loopt of uitgeworpen wordt, groen als het klaar is met 0 of 100, oranje knipperend voor andere resultaten of mislukte uitwerping<br/>3: Groen terwijl het script loopt en tijdens het uitwerpen, UIT als het klaar is, oranje knipperend als de uitwerping mislukt.",
"subitems": [{
"key": "config_LED",
"autoSelect": true,
"editable": false,
"desc":"Status-LED",
"width": "360",
"mode": "local",
"valueField": "myId",
"displayField": "displayText",
"defaultValue": "@LED@",
"store": {
"xtype": "arraystore",
"fields": ["myId", "displayText"],
"data": [[0, "0 Not used"], [1, "1 grn - grnFlash - OFF or orgFlash"], [2, "2 grnFlash - grnFlash - grn or orgFlash"], [3, "3 grn - grn - OFF or orgFlash"]]
}
}]
}
,{
"type": "multiselect",
"desc":"<br/>Beepgebruik door het script: Korte piep aan begin en einde, driedubbele lange piep voor een fout.",
"subitems": [{
"key": "config_BEEP",
"desc":"Pieptoon bij begin en einde",
"defaultValue": "@BEEP@"
}]
}
,{
"type": "textfield"
,"desc":"Als het script eindigt met de exitcode 100, wordt geprobeerd het apparaat uit te werpen. U kunt de time-out (in seconden) voor het uitwerpen van het apparaat opgeven"
,"subitems": [{
"key": "config_EJECT_TIMEOUT"
,"desc":"Eject Timeout [s]"
,"defaultValue": "@EJECT_TIMEOUT@"
,"validator": {
"allowBlank": false
,"regex": {
"expr": "/^[0-9]+$/"
,"errorText":"Voer een positief getal in"
}
}
}]
}
,{
"type": "textfield",
"desc":"U kunt optioneel nog een script opgeven (met volledig pad!), dat in geval van gevraagd uitwerpen (met exitcode 100 van uw 1e script) wordt uitgevoerd na het uitwerpen. Dit kan bijvoorbeeld worden gebruikt om uw USB-apparaat uit te schakelen. Als het uitwerpen mislukt, is het argument \"Uitwerpen mislukt\", bij succes geen argument!",
"subitems": [{
"key": "config_SCRIPT_AFTER_EJECT",
"desc":"Script na uitwerpen (op DSM)",
"width": "350",
"defaultValue": "@SCRIPT_AFTER_EJECT@",
"validator": {
"allowBlank": true
}
}]
}
]
}
,{
"step_title":"Veiligheidsconfiguratie",
"items": [{
"type": "combobox",
"desc":"Het script met de overeenkomende naam wordt uitgevoerd met root rechten op je DSM! Dat kan een veiligheidsrisico zijn, vooral als het zich op een extern apparaat bevindt! Voor een betere beveiliging is een beperking tot scripts met vooraf geregistreerde sha256 hashwaarden (vingerafdrukken) mogelijk.<br/><b>Eigenlijk zijn er @ENTRY_COUNT@ script hashes geregistreerd.</b><br/>0: De beveiligingsfunctie wordt niet gebruikt. Alle scripts met dezelfde naam zijn toegestaan. Geen verandering van geregistreerde hashes.<br/>1: @HASH_DELETION@Het 1e script na installatie/configuratie wordt geregistreerd en mag steeds opnieuw worden uitgevoerd.<br/>2: De hash waarde van elk script met dezelfde naam wordt geregistreerd en uitgevoerd! (Voeg hashes toe)<br/>3: Alleen eerder geregistreerde scripts zijn toegestaan. (Registratie bevroren)",
"subitems": [{
"key": "config_ADD_NEW_FINGERPRINTS"
,"autoSelect": true
,"editable": false
,"desc":"Script Hash registratie"
,"width": "360"
,"mode": "local"
,"valueField": "myId"
,"displayField": "displayText"
,"defaultValue": "@ADD_NEW_FINGERPRINTS@"
,"store": {
"xtype": "arraystore"
,"fields": ["myId", "displayText"]
,"data": [[0, "0 Feature not used (unrestricted)"], [1, "1 1st script allowed"], [2, "2 Add any hash value"], [3, "3 Only previously registered"]]
}
,"validator": {
"regex": {
"expr": "/^[@SECURITY_RANGE@].*/"
,"errorText":"Zonder eerder geregistreerde hashes heeft de selectie \"3\" geen zin."
}
}
}]
}]
}
,{
"step_title":"BELANGRIJK: Handmatige actie vereist!",
"items": [{
"type": "textfield",
"desc":"Pakketten van derden worden beperkt door Synology in DSM 7.x! Omdat autorun toestemming van root nodig heeft om zijn werk te doen, is een extra handmatige stap nodig na de installatie.<br/><br/>Open een SSH commando schil naar uw NAS (als een admin gebruiker) en voer het volgende commando uit <b>nadat</b> de installatie is voltooid.<br>In plaats van via een SSH commando venster kunt u dit commando uitvoeren via een door de gebruiker gedefinieerd script (als gebruiker 'root'), gegenereerd via het configuratiescherm, geplande taak. En voer dat uit na de voltooide installatie.<br>U mag het commando nu kopiëren!",
"subitems": [{
"key": "ignore_value",
"desc":"Commando",
"width": "440",
"defaultValue": "sudo cp /var/packages/autorun/conf/privilege.root /var/packages/autorun/conf/privilege"
}]
}]
}
]

